{"ids": ["1zfKZYKm", "XV0ovdYz", "2W9k8vY2", "cWL2u2ML", "5uRDrTZm", "lxWfRffr", "Sa3jFTR4", "BT4Xxj4Q", "lEmMDwnS", "ECMOrv7z", "71yaQ0GW", "nSC3Dx1y", "saeDQuca", "Zz9nexCn", "e4H7GmPF", "Ry2NGs0Q", "8lomzFql", "NMWVbhOc", "lenKLeTu", "uryu5PKX", "qBrKFARz", "89Y9HiPj", "baR07DN4", "lNymbdmA", "U8SUeFmo", "l7UoXop4", "TYYh1EvB", "hPiWRwRW", "tSfR1Vcj", "1BPk1Lbt", "SCDRFrzT", "yC272YiX", "GeDrRBvG", "m4vi0Yqx", "rCBegKoB", "alhwdgG3", "WOZrVU9i", "Kwtc7uuQ", "bDdxJj6V", "WCymZdtL", "zGfXF2iJ", "UJbk8THs", "pGJujbqr", "WWQsLnM4", "yFCw8LkO", "aQeHCRTw", "xD7ZvgTi", "Tdfhp0IO", "3bdnRXKI", "ruJfyXYW", "6xHBBM3E", "cydmJFg0", "1bgAiNLg", "rCs7rd3D", "lebiuQCC", "gWU3I6W4", "Tzoll87C", "W2bI9L8J", "ulzfyXoO", "sPhfbR9Z", "lsLj86ah", "FrOszLF6", "W1l8HLBi", "jGAc0LZ2", "hp7gTNkD", "GYQisT7H", "qATYXI3V", "8wywdtmG", "WurI1VBw", "SdiDIoh1", "2Kq6FqjZ", "7FiM8JPh", "ZB0CLJR5", "MmosZXZM", "9MNTRa0t", "z3ODmwar", "DovZREXp", "IxWVIo3y", "SfBZ5LEk", "lvjLc65m"], "dialog": [["I just use the boostrap 3 css. I'm not really satisfied with the current state of any of the libs", "it's a problem with many ng wrappers. Often one-man shows that are maintained for a year or two before they start to rot.", "And even with maintained packages, they tend to lag"], ["Hello", "Can anyone help me figure out how to bundle my Angular 2 app into a 'bundle.js' file to be put onto heroku and served from an express server?", "adamgarcia4: The CLI makes that pretty easy. Otherwise one of the Angular seeds and their build steps might be a good place to start.", "piercers: I started a project from scratch, following one of the Udemy courses.  Would you suggest that I port everything over to the CLI folder structure?", "adamgarcia4: You might not need to go that far. I’m just pointing out those other options as inspiration. If your code is in TypeScript, it shouldn’t be too difficult to port it over if it came down to that.", "Pardon my inexperience.  hmm, does the angular cli webpack support being able to run an express server?", "yes", "Alright, time to port my project over to the angular cli!  ", "Wish me luck"], ["Hi guys, I'm trying to bootstrap an Angular2 app inside shadowdom. Shadowdom v1 doesn't have /deep/ so I don't think I can use selector. Is there any way to pass an actual HTMLElement for the entrypoint? I assume that should be possible with platform-browser"], ["Can I create a dummy component in my TestBed from a raw template string in order to test my directive? [<-CODE->] but it points to internals. which doesn't seem like a good idea. How can I produce components in this way without using angular internals?"], ["[<-CODE->]  [<-CODE->]. can I somehow inject Math object to use inside my template?", "[<-CODE->] ", "DzmitryShylovich: I got it to work as you explained, thank you!", "PhotoPaul: creating a pipe is more elegant", "n00dl3: You are right, but this is already part of a 3 piece pipe so I thought of keeping it simple, Maybe if I need to use it again I will convert it into a pipe"], ["How can I delay showing my \"loading-screen\" to only show if the Observable takes more than x ms to return a result?"], ["Hi guys! ", "I just got out of HTML, CSS and some basic Javascript. I'm now studying AngularJS. There are topics on $http and route resolvers which I don't get. I was wondering if I need background on some backend stuff, nodeJS perhaps, to understand $http/route resolvers better?", "Matteoo7: also, are you familiar with the concept of client-side routing in a SPA?", "alxhub: nope. not yet at least. ", "what do you recommend?", "Matteoo7: , well,$http suggests you're talking about Angular1. This is the Angular2 chat.", "So you could head over to the Angular1 gitter at [<-LINK->] and ask the awesome folks there.", "alxhub: ah, yes. I better move to the other side of the chat room. Thanks though!", "And also, if you're sticking with Angular1, [<-LINK->] will help you understand client-side routing and resolve a little better. Or you could decide to do the Angular2 tutorial instead: [<-LINK->]", "Up to you :)", "alxhub: all very helpful resources! Im going to go through client-side routing first and the whole angular1 before checking out angular2. Surely, it'll be of some help when I get to angular2 :)", "Eh, actually, they're sufficiently different that it's better to go straight to Angular2.", "oh", "ohhhhhh", "alxhub: thank you, if i'm going to save time, it's going to be because of you! Thank you for your time, very much appreciated. I guess I'll be off with Angular2 now"], ["Soooo apparently Im terrible at codingAnyone got some suggestions at how to Transform a nested tree. like from data models into database modelsit's the thing I was working on this morning, question has multiple questions", ":/", "you're using relational database? basically like a .map() but... with a tree. ", "Yeah, but it can be represented in models, just need to get it to the right ones", "that's exactly why we have mongodb", "so we don't need a strict schema migrate.", "well even then, i'd still have the same issue", "no you wouldn't you'd just save the json, save JSON.stringify of your tree in a database cell", "I need to get it to models that have things like, created by, created at, other ID's and what not", "[<-CODE->] ", "what I mean is my UI is giving me something like [<-CODE->] but it needs to be [<-CODE->]. the count is for multiplying it out btw, so if it's 3 I need to make 3 copies of that one"], ["Morning everyone. Hope everyone had a good weekend.", "Does anyone  use ng-bootstrap/ng-bootstrap modal component?"], ["Hi, quick question: I am trying to find the parentNode of an element contained in a component. The last parentNode is the first child of the component. I want to catch the component as the parentNode. Do you know how to do this? I forgot to mention that this is outside of angular."], ["hey all. ", "I’m trying to get myself rolling with ng2 and am having a problem with my unit tests. used the cli to make a project, added a module (angular material) and got it working in my hello-world. But, when I run my tests withng testI getError: Template parse errors:\\n    'md-card' is not a known element:I imagine my unit test environment isnt loading the module, but I just dont know wher eto go to fix that situation… any guidance?", "brendanjerwin: it sounds like you haven't imported angular material into your test.  [<-LINK->]"], ["The PreloadAllModules strategy you can use - how does it deal with modules that are only called in the routes of nested modules? For example, my app lazyloads the store module, and that lazyloads the cart module, so there's no direct reference to cart in the base app routes. Will the compilation stage cascade it all down so that preloading will preload both?"], ["Rob I've been studying your writings lately. Huge help for me getting organized. Thanks!"], ["I am working with forms... but if the form is too large then covers the whole page...Any suggestions on how to control the design layout? [<-LINK->]"], ["Does anyone has good library for rxjs + socket.io? how can i disconnect from a websocket automatically when no component using it in the dom? i dont want to hold many websockets because its resource consuming or atleast thats what i think it is, correct me if im wrong. i want kind of lazy usage of websockets is it possible?", "lihaibh: use the websocket subject in rxjs or wrap your websocket into an observable and share it", "and how would i know when to disconnect?", "when all subscribers unsubscribe then the dispose function will be executed as long as you “share” it.  I think share has been removed so you would need to run .publishReplay(1).refcount().", "publishReplay? not regular 'publish'?", "I had to implement an operator that delayed the dispose though, because since changing routes will destroy the components before the new ones are created and the websocket connection will be torn down. It’s to share only 1 version of the websocket"], ["what's the barcode scanner thingy? :(", "somebody asked earlier if they could scan barcodes in html5", "i mean, what do i point at the camera? a usual barcode? works pretty well here [<-LINK->] so i guess it's something with plunker not displaying the green squiggly lines", "Are we meant to scan barcodes with it? tried it on my phone and it uses my front camera lol", "yeah it works for some stuff i have on desk by shoing green lines but doesn't recognize it as a barcode", "works when pointing to site's logo (talking about my link above, not the plunker). probably those locales and commy stuff as rob said :)", "ok well now it's using the back one but im not seeing naything come up either"], ["Hi all", "we are having some issues with translations in our application as we have multiple sources of XLF that we want to inject.Is there an option to change the format from xlf to JSON or some other easy to parse in the frontend value?"], ["How can Inject Router,ActivatedRoute - it'sundefinedin my Compontent's constructor. I've read we should register ROUTER_PROVIDERS but that doesn't seem to exist in latest angular2, what should I be registering instead? can't find an example on plunkr that uses the new router, everything uses ROUTER_DIRECTIVES, e.g: [<-LINK->] is there anything that replaces it?", "mythz:  [<-LINK->] ", "DzmitryShylovich: thx. checking it out"], ["has flatmap been removed from rxjs?", "nope, u need to import it", "DzmitryShylovich: well i canot find it o.o"], ["Could anyone spare 5 minutes to talk through some ideal angular structure perhaps in private? I could paste it here but I don't want to spam the channel"], ["Hello"], ["off topic: any used AMP ?", "only awp", "seriously though, how'd you handle it?", "handle what?", "erm, awp?", "Toxicable: yes on AMP. i'm experimenting with AMP + universal", "Oh so it actually works with Angular?", "Toxicable: lol u don't know what is awp?", "nope", "AMP", "Accelerated mobile pages", "Take out your smartphone, Google \"AMP\"", "awp", "Toxicable: AMP pages can't run any JS in the browser", "robwormald: Yeah that's what I thought, then I realized that's probably why you said + universal  :D"], ["Hello Friend", "Hello all", "I need help", "I am using trackBy in ngFor. but the variables defined in constructor are not accessible in trackBy function", "please help me", "DzmitryShylovich: please help me", "gargtushar: why do u need the variables defined in constructor inside trackBy?", "gargtushar: why not set those variables somewhere in your class? Then, in the trackBy function, you can refer them with this.property.", "they are also not available here.  [<-CODE->]. I need to hit the service in the trackBy function", "wut", "i want to hit a http get request in the track by on the basis of ID of children and returns is details to dislay", "if I understood correctly, you don't use trackBy to make requests. RT wut.", "gargtushar: why?", "trackBy cant resolve async functions and it shouldn't at all", "u should stop watching anime really", "gargtushar: I refuse to believe that, you can query for their ID afterwards but not before?", "please tell me how to make that accessible in trackBy function. but i am unable to pass extra params to this function. how can i pass", "gargtushar: how can you pass what?", "gargtushar: hope u are trolling :)", "I want that magen to service variable inside trackBy function"], ["Working on the Pythagoras tree for Ng... Trying to get the maximum performance.. I'm around a frame rate of 20fps.. (but the cycle version is around 40fps. ) The main problem is the recursive component.. that executes too many things..", "seems like inferno has the best performance. I don’t know why. Maybe all that type checking from TypeScript adds runtime overhead after transpiling?:)", "Now this… this was smooth on my machine. Maybe it just feels smooth because I looked at it right after the Angular version, but damn.", "DzmitryShylovich: this is the part i don't like...", "because the teropa version is not reactive... and really is slow... just try it... clonning..."], ["Does anyone know where I can go to get help with angular2 and the jasmine testing framework? I'm trying to create a jasmine test that makes sure console.log is called in my app.component's ngOnInit my code is here but that doesn't seem to work. more specifically it says \"Expected spy log to have been called.\" so I guess it just hasn\\'t...."], ["Reactive forms Question:  What's the best way to handle conditional validation?  Say you have two radio buttons, and selecting one displays a subform with required fields.  If the other radio button is selected, then the form's validity should not consider the (hidden) subform's validity.  So far I've considered: [<-CODE->] Both of these are ugly, but #1 seems like a better approach to me.  Anyone else deal with this?"], ["Has anyone here completed Deborah Kurata\\'s \"Getting started with Angular\" course on Pluralsight ????"], ["Hi guys.. long time no see"], ["Hi Folks,", "Can  anyone  looks into this issue and help me out http://stackoverflow.com/questions/41177558/angular-2-nested-routing-for-two-level"], ["is it possible to use lazy loading for sub routes ? (eg ModuleA is lazy loaded from app-routing.module, and ModuleB is lazy loaded from module-a-routing.module)"], ["Morning everyone"], ["Hi,I have an input text to enter the date.if the user enters m/d/yyyy eg:1/3/2016How to add 0 to the date to be mm/dd/yyyy eg: 01/03/2016??", "\"format date javascript\" -> google", "deja vu", "yeah, lol", "a glitch in the matrix", "noamichael: Thanks.", "How to format the Date I am beginnerIs there a method get or set day or month?", "_: @", "win8it:  [<-LINK->]", "[<-LINK->]", "win8it: u are looking for [<-ISSUE->] but it's not impelmented yet", "gl Eric :)", ";_;", "Thanks@noamichael,@ericmartinezrand@DzmitryShylovich"], ["So I am trying to follow the guide laid out in [<-LINK->] , but I don’t understand where the “User” interface file fits in. i agree that line isn’t needed. But mine fails saying the this.myForm element isn’t defined. And when I run it live I get no errors, just a blank page", "@jesmith17 this.myForm element isn’t defined. u need to define it before actually using", "just add [<-CODE->]. before constructor declaration", "I did in mine. But I still get a blank form when I run it via “ng serve\". And no errors in the console at all", "Just trying to find out why the plunker worked but doesn’t when run for real. Hoping I am missing something small", "do u have;at the end of the lines?", "my last attempt literally copied and pasted his code directly, I then added in the necessar declaration for the myForm: FormGroup object", "ok...", "it feels like I am just missing one little thing, but I can’t track down what it is as I don’t get any console errors to help. Added a console.log to both the construtor and the ngOnInit methods, and neither fires", "did u add your component on the page at all? may be incorrect seelctor?", "I thought that as well, but selector is fine as it showed the template driven form before I added the reactive stuff", "have you imported ReactiveFormsModule ?", "I did. ", "I think I found it, and it was a stupid error on my side. I had added this new component as a new route, and while I had tested the routing before addig in the reactive stuff, I had missed that the URL had gotten reset, so it was calling the wrong component. rookie mistake on my part.", "Thanks for the help everyone."], ["hello", "my pipe not filter.  [<-LINK->] ", "what's the error?@kiokotzu", "Toxicable: 43/5000It goes empty, but when I type there if you search", "kiokotzu: what? I don't know what you mean by thatwhat's the error? or if you cant explain the error can you reproduce in a plunkr", "Toxicable: Sorry for my english, I'm trying to do this in angular 2.  [<-LINK->]", "kiokotzu: oaky so can you reproduce your error in a plunkr [<-LINK->]", "vale"], ["Hi, everyBody", "hiii doctor nick", "can you help  me in this code !", "is that a question or a statement ?", "[<-LINK->] "], ["How do you access the previous state in ngrx?", "jxxcarlson: previous? as in the one before you changed it? you would have to log it somewhere.", "derek: Cool. I will do that", "i thought you could use [<-LINK->] to do \"time travelling\"", "never done it myself though", "oops i can't read@bonnici just said that"], ["Hi everyone i am facing some difficulties described here : [<-LINK->] . If anyone as the time to try to answer my question i would really appreciate it thank you very much.", "[<-LINK->] @dgorobopecwe were discussing this an hour ago, as far as I can tell you can do only html templates with i18n, so I would suggest ng2-translate if you need ts code as well"], ["Good morning", "I know this is the angular gitter, but is anyone using webpack? The webpack gitter seems to be dead", "broweratcognitecdotcom: yeah a lot of people are using webpack here", "What do you want to know?", "emilaasa: Is it possible to open your web app hosted on another machine using webpack-dev-server ?", "emilaasa: I can't open my app in firefox on my machine when it is being hosted by webpack-dev-server on another machine", "basically, I followed the angular quick start which uses system.js. Then I converted my project to use webpack. it builds. I can start it, but I can't access it", "Hmm. I havent run in to that use case. =)", "emilaasa: You are developing and looking at your app on the same machine I guess?", "[<-CODE->], Can you please show me this part of your package.json?", "Yeah, and using a real http server to deploy it to CI env. Not too dissimilar from that repo, except quite a bit less features", "emilaasa: Ya, I'm trying not to use 'mighty' examples but just get something simple working.", "But thanks, I'll look closely at that see if I can find something", "emilaasa: so are you using webpack-dev-server at all? [<-CODE->]", "I've tried [<-LINK->] and [<-LINK->] and [<-LINK->] and [<-LINK->] and I get nuttin. Just gets aborted."], ["Where can I find more info on the Angular 4 router, I am creating a tutorial which is due for release in Q2 2017, so it makes sense that I try to work with it now, if possible", "[<-LINK->] ", "DzmitryShylovich: was that for me? If that covers the angular 2 router, will that not be different than the angular 4 router if the purpose of Angular 4 is the router version 4?", "AlexZan:  [<-LINK->]"], ["diff b/w angular and angular2", "angular4", "[checked] is an angular event", "some times angular 2 documentation so confused pls answer", "agilanshanthi:  [<-LINK->]", "agilanshanthi:  [<-LINK->]"], ["Hello friends.Can you help me to resolve a problem with how to build nested model-driven forms?Here is the plunker [<-LINK->] The problem is when is try to embedded a third form control."], ["ilennert: I'm trying to deploy this repo. [<-LINK->] , using the tasknpm run tscto output directory dist, but how do I configure this for use with, say, firebase?  The build process does not copy node_modules, so I get this error when I try to runhttp-server .in thedistdirectory:Failed to load resource: the server responded with a status of 404 (Not Found)", "e-beach: , your missing a few things here.  It looks like your bootstrapping as you would if you were using Webpack (the recommended way) but you don't have any webpack stuff in your package.json or repo.  ", "Please allow me to recommend this video, it will answer all your questions! [<-LINK->]", "ilennert: Thanks!"], ["Hey guys, [<-CODE->] one time binding operator in our templates?' I know online I saw people built solutions to this in JS in their components, but is this something that is relevant for Angular 2? Does it have the same perf benefits as it did in angular 1?", "josephliccini: I can\\'t say for sure, but I think the \"most equivalent\" option is ChangeDetectionStrategy.OnPush (assuming I understand what one-time binding operator did in ng1)", "You can read this too [<-LINK->] ", "And this@josephliccini [<-LINK->] ", "ericmartinezr: thanks! ", "I will read these.  I believe Angular 1 one-time binding was so you could write data to the template, but then not have it check for updates in change detection later.  That is, once angular set the value in the template, it would not update it later."], ["Is it normal that if I change of view in my app, a validator gets triggered multiple times?"], ["someone awake?", "[<-CODE->] this dont works,  but I need to press the to vars row and col into the component cell. any idea for me?", "[<-CODE->] or the other way around  [<-LINK->] ", "oh yeah nice, i try", "bonnici:  [<-CODE->] ", "ByMiles: have you done the Tour of Heroes introductory tutorial?", "like this? somewhere might be a bug, still not working", "yes i looked it up", "Have you gone through it though, and followed along and built the ToH app?", "i buid two nother tutorials from youtube^^", "problem for me they always only handle text data", "What's the actual error that you're getting?", "no errror in compilor, but the side is \"loading...\"", "i think the row [<-CODE->]  is not correct in the component cell i have@input row: number", "You're right that's not correct.", "That's why I suggested doing Tour of Heroes. You need some practice with the data binding syntax. And reading the error messages that you're getting.", "there is no error message", ":(", "and on the ToH is no example with two variables in one component", "The error is probably in your browser javascript console.", "[URL= [<-LINK->] ]", "thats the way it looks without this row", "Bindings use normal HTML attribute syntax  [<-CODE->]. Note the space after<tagand the quotes around expressions and values", "when i understand this right, this line helped me more than 2 hours reading and reading...", "let me try", "alxhub: no it says: \"attributs are not allowed here\"", "but that exactly what i want to do, i want to set an attribute...", "ByMiles: , have you seen Plunker? [<-LINK->] ", "See if you can reproduce your problem there.", "now it works, i think ;)", "alxhub: are you still out there? i need a hint. Its harder then thougt to switch from java fx to angular...", "depending on 2 booleans i want to hide or color a circle or draw another one. ", "do you have a hint in which way i should think?"], ["I\\'m developing an angular 2 app. So essentialy, if I run the app with \"ng serve\" all works fine, if I refresh the page (for example [<-LINK->] ) it works fine and angular recognizes the right route. The problem occurs when I build the app in a war and deploy it on wildfly with a different context path (ex. /myapp). At this point the routing navigation works fine but if I refresh the page I receive a \"Not found error\". My base href on index.html is <base href=\".\"> I also tried with <base href=\"./myapp\"> but in this case angular try to look for the resources under [<-LINK->] and not under [<-LINK->] Anyone have any idea on how to fix it?", "I think the base href should really be just /./", "fplini:  [<-CODE->] ", "DzmitryShylovich: yes with this script it works fine, but when I refresh I received a \"not found\" error", "path/hash location strategy?", "Uhm.. If I add the hash the refresh is ok but ng2 doesn't recognize the route and redirects on  home but the url is broken.. let me explain better with an example", "fplini: add this to your appmodules providers [<-CODE->] ", "my url is [<-LINK->] if I refresh the page I get a not found error. Instead if i go on [<-LINK->] the app goes on the home and the new url is [<-LINK->] ", "SamiAl90: I'm going to try with this code ;)", "fplini: what location strategy do u use?", "default one?", "yes default (without hash)", "fplini: u need to configure your server to return index.html for all angular routes", "I'm only set the context root path in the jboss-web.xml to make available the app under the right path", "I'm serious", "fplini:  [<-LINK->] ", "DzmitryShylovich: thanks I'm going to check it and try a lot. I'll come back later :)"], ["is there a great up to date angular-cli hello world git repo that can be forked?"], ["how subscribe on  each ngModel changes on template driven form ?"], ["I was hoping to see examples of how people shape the data and in what they store that data in (class/interface?)", "Interface. Don't use classes to transfer data. Use map to transform your data", "Thanks*"], ["Newbie question: why would it be that my styles.scss file’s variables wouldn’t be available to a component? I’m getting “undefined variable” even though the variable is declared in my top level style.scss file.", "etsuo: you need to import the styles.scss in to the components style sheet or you need to add it to the styleUrls", "jjstreet: where’s the styleUrls?", "[<-CODE->] ", "Oh…. i see… ", "so it doesn’t get imported top level? like in the index.html?", "scss is a preprocessed language, so you can't import them into html like any other css file", "right, but I would have expected style.scss to be compiled down to style.css. that’s the global style", "right", "but variables in that file aren't magically available to other scss files, you have to import that styles.scss file into them", "OOOOO i get it… thanks@jjstreet", "sorry, so I tried:[<-CODE->] but I’m still getting Undefined variable: \"$colors”when I try to access the $colors variable defined in the styles.sass file that’s meant for global styles… :/?", "etsuo: try doing import in the app.component.scss file", "jjstreet: that did the trick… thanks", "etsuo: np"], ["Hello.", "can anyone help me with pwa using angular 2", "pwa's are still experimental. I doubt anyone will know anything about them", "Okay. Thank you@Toxicable."], ["Can  service implementing CanActivate receive param ? I want my route guard to check according to some param ...`canActivate: [ AuthGuard .. . some param ],", "macdasi: it would have access to the router params"], ["Guys any idea how to solve this error? [<-CODE->] error: Property 'uid' does not exist on type '{}'.", "cast 'res' to your object.then((res: any) => {", "(res : any) is not working, and", "it should"], ["is it a good idea to.share()on a selector with ngrx ? I think it is but thinking of any downside ... ?"], ["Guys, how should I call my async validator? I've got a service which looks like this: [<-CODE->] and I call just simply this way  [<-CODE->] But the input always invalid", "zedz01: why do you use new Promise ? ", "You can use toPromise() operator ..."], ["I have ngOnInit setup in my component. but when I send the component data via@Inputhow do I get a function to fire? ngOnInit only happens once so it is sort of irrelavent", "What's OnChanges for?"], ["I have used some many jquery codes in an app, i am beginning to feel guilty of an unknown crime. do i have anything to worry about", "you don't be platform agnostic anymore. so no Universal, no Mobile, no Desktop", "Toxicable: was that for me?", "Ellipizle: yup", "so what's the equivalent of  this$('#myModal').modal('hide')", "Ellipizle: what do you mean? that's using jquery and boostrap which Angular itself knows nothing of"], ["hey ,all!I have problem with downloading local csv file.I have a cli project and my file in src folder.I have next template: [<-CODE->] But it just doesn't work. Any ideas?", "I don't think angular-cli serves files from /src directly. ", "put them into assets, as it gets copied over during serve/build"], ["Hey guys what is the best way to add scripts to my component? My end goal is to have my header.component become static after certain scroll height is reached. I'm using angular-cli. It's not every page that I want this to happen only in certain pages"], ["Is there any way of preserving component state when leaving for another route? I know one - using service", "sinedsem: RouteReuseStartegy", "Redux", "use a service", "sinedsem: A service can be an easy way to do this, otherwise some implementation of state management like ngrx/Store or Redux", "2 votes for service and 1 vote for one more poorly documented thing - routeReuseStrategy", "services are boring :)", "oh if we're voting i'd vote for ngrx/Store", "it depends on yor use case", "^ and your knowledge of flux architecture"], ["Hello there! I am trying to write some tests for a component which is using the ng2-bootstrap's DropdownModule and ButtonModule. I have placed both modules in the spec's imports array However, I'm getting the following error message: Can't bind to 'isOpen' since it isn't a known property of 'div'Any suggestions on what to do here?", "tuomasi: did u import DropdownModule and ButtonModule? in your test module", "Ah, I thought I did. But I wrote 'import' instead of 'imports'...sorry and thanks! :)", "your IDE should handle that, also you should've seen compilation errors from ts :)", "Nope, there was no such message. Otherwise I probably would not have come here :P"], ["Trying to get modules working properly in our app. Currently stuck at our collection of pipes, gathered in a PipeModule. If I import the module in multiple other modules that use the pipes I get an error sayingFooPipe is part of the declaration of 2 modules: PipeModule and PipeModule. If I only import it in our AppModule I get errors saying angular cant find the pipe. Am I missing something obvious here? o.O", "urrang: did you export in PipeModule and only import in the other modules?", "PipesModule has declarations & exports for the different pipes, everywhere else its just an import of PipesModule form what I can tell (/project search can find)", "urrang: you dont need to import the pipe in all modules, only in the appmodule", "Thats what I figured, but I seem to be getting errors now saying the pipes cannot be found", "imports: [..., PipesModule]", "ohh", "had also problems with pipes but can't remember ^^  (good that you can say now \"it was last year) ;-)", "If its not anything obvious I probably just need to dig deeper in our clusterfuck of modules. Kind of hard fixing a huge project when all examples have one root module that imports one other module with a single component", "but I also have my custom pipes as providers in my sharedModule... really no idea why", "But generally importing a module multiple places should not be a problem then? Or should you only have to import the shared modules in your root module, and it will in theory work everywhere?", "in the app module do:declarations: [...PIPES,]", "Mkay, so no module for the pipes then? Worth a shot", "i have a module : SharedModule", "me2", "and have all pipes, serices", "services*", "And you only import that at the top, then its available everywhere?", "and I import the SharedModule in the App Module and the sharedmodule inside imports in appmodule", "Alright, then im on the right path at least. Thanks!", "The ngmodule anotation in SharedModule looks like: [<-CODE->]", "urrang: give it a shot to also add your Pipes toproviders:in your PipeModule", "if I remove them from there, I also get an error in my feature modules which are using them", "dklmuc: I'll look into that, thanks a lot!"], ["Hey guys! Are there any best practices (rough estimates, opinions whatever) in terms of how big components should be? When is a component too large? How can one refactor code so that the code becomes easier to test?"], ["I've got an array of objects, and I've got an issue where something works if I unshift a new object into the array, but if I push an object then it doesn't work. Because I'm guessing that the array isn't being redrawn in the same way when I push. Is there any way to force a redraw so it behaves the same for unshift and push?@DzmitryShylovich Any idea?", "chrillewoodz: u should create a new array instead of mutating"], ["@losorio2015_twitterHello guys, when I consult an observable, it emits me 2 timesThe first obsevable emptyAnd the second observable with date.How can I avoid it, just ask me 2 times?I just want you to consult me, the observable date@Dorusbefore you modifiy them (or just dont modify) [<-LINK->]. I consult my observable state, with the operator select ()", "make a plunker. screenshots don't help anyone diagnose anything", "@robwormald , I am only consulting my state, observable, with this line [<-CODE->];And I am emitting 2 times the observable.", "I'm using the project, from the official app example  [<-LINK->]. When I use the first () operator, it emits only once the observable one, but I get the observable [<-CODE->]", "again. make a plunker. it is impossible to diagnose your code with you explaining it line by line, or posting screenshots", "I understand,@robwormald, I'm going to try to make a plunker", "here's a starter [<-LINK->]", "thank"], ["cmon guys, it's such a simple question: how to show component by calling service function?"], ["[<-CODE->] Why does mij startAnimation() function fire when the message.animationState is set to the 'first' state? [<-CODE->]", "are you sure it's not changing. like it has a default value and you're setting a different value right after", "maybe because im setting the value to inactive, If i go from null -> active", "if you're setting the value to inactive it shouldn't because you don't have transition that ends with inactive. it goes from opacity 0.5 to opacity 1, without any transition, because you have not set it...", "ghetolay: indeed, but even if the state is null, the done function fires", "on animation state null is also a transition... form void => inactive", "how can i set it up so that the done event does not fire?  [<-CODE->] because this is not working", "jordic: you sure the callback is always called ? even for non-defined animation ?", "or can i sepicify on what transition the done event fires?", "not sure if is a feature or a bug ... but is the only way of explaining the situation...", "perhaps you can check the event... I think it contains this kind of information...", "Sure, so pass the event to a function", "The callbacks receive an AnimationTransitionEvent which contains useful properties such as fromState, toState and totalTime.", "okay i can try that", "[<-LINK->] You were right", "ok learned something", "ghetolay: your idea to use a different array to store animation states worked! the ngFor loop animates one message at a time.", "DirkWolthuis: well you seem to look surprised", "No not at all. Just gratefull", ":)", "glad I could help", "thanks!", "my day was not completely wasted", "Maybe i will use my new knowlegde to make a blogpost or something", "DirkWolthuis: as animation idea, this is perhaps more hacky... [<-LINK->]", "jordic: need to read more about observables to fully understand your example. But I think my solutions is pretty safe."], ["Hello! If I have this code<my-component (click)=\"onClick()\"></my-component>, is there any way to programatically remove the event listener after the first event? Or something similar to jQuery.one() where the handler is executed at most once per element?"], ["Hello, I am new in A2. I am trying to develop an app where users fill the search form and click search button , it sends request to API to get results. This search form is in one component and I want to display the search result in another component on the same web page. How can I make so that when I click search button in \"searchform\" component, the result will be displayed in \"results\" component ? I have searchservice to handle the http request. How can i make connection with search button to trigger to load the result lists in result component ?", "@sayedrakib If your components are siblings then try to send event to the parent component to initialize the results to some variable say <srch_results> and using the bindings for the results component set one to get <srch_results>  and do what ever you want with that data in your results component.You can do it via services, Observables too.But if the results is a child component then you can do it directly thinking a bit will give you the sol.And for more on this read about component interacion cookbook on angular 2 website.https://angular.io/docs/ts/latest/cookbook/component-communication.html"], ["ergh, i feel like a dummy for asking, but in my templates i wrote [@someInput]=\"something\" for the life of me i can\\'t remember why i put the @ in, what\\'s @ do?", "doh! i remember now nvm :D"], ["why does one shipngccompiled sources with a component for AoT, i.e. why make thecompileddirectory part of the repository?"], ["Hello I am used ngDatepicker.. that datepicker I have put in modal(pop up). when I am closed modal that time I want to date value clear. anyone help me please?", "Toxicable: Can you help me please?", "I have no idea", "Ohk thanks "], ["hi all, is there a way to configure the currency pipe to use single quotes instead of commas?[<-CODE->]. any ideas, anyone??? hi all, is there a way to configure the currency pipe to use single quotes instead of commas?[<-CODE->]", "geekrumper: make a custom pipe which extends the currency pipe", "thanks@dklmuc... not so funny", "no context, but I know what you mean a second pipe which transforms comas to quotes..."], ["HI guys,  I'm using angular-cli beta.26 and when I try to build my porject usingng build --prod --aot --base-href /frontdesk2/I get the stacktraceERROR in vendor.7e4f12f39ba998306173.bundle.js from UglifyJs\\nSyntaxError: Unexpected token: name (isLastCharLower) [vendor.7e4f12f39ba998306173.bundle.js:50363,5]Have someone idea about it?  [<-CODE->] ", "so... it seems in AoT you can't use useValue in a provider  if the value isn't known in compile time", "Hmm. So you are saying instead of putting the component startup logic right in ngOnInit, put some subscribing-to-store block in ngOnInit so that the initialization logic can go in that subscribe block and therefore won't get fired until the store is ready?", "but the compiler doesn't complain and you get anullin runtime", "I'll moving this questionn to angular cli group, thanks"], ["any ideas why I\\'m not getting \"Only initialized variables and constants can be referenced because the value of this variable is needed by the template compiler\" when I updated ng?", "DzmitryShylovich: has some comments mentioning that it's AOT?"], ["Hello Guys please help me in md2-select... How to one value by default active?", "create credits.json file :)", "DzmitryShylovich: Can you tell me please how to set by default active in md2-select?", "aminsmartsense: never used it but logic would say just set [<-CODE->] and the item should be the active one pre-defined if you have the options  [<-CODE->]", "But I am Designer so I want to add only static data like this"], ["I am confused by this, and is probably a misunderstanding on my part. but how is it possible to not support 2.1?   When I add angular to my project, aren't I just consuming the javascript and typings?  How is it possible for Angular TS to conflict with mine?"], ["Hi All, I need to have a tabs in my app. each tab will load its own component. so there would be parent component which will have 3 tabs and each tab will load its own component when user clicks on it. any solution to achieve this ?", "vishalgajjar: Exactly what you just said lol", "Just make the tabs with router Links and a <router-outlet> underneath", "HauntedSmores: there is already one router-outlet in the application so how to target the child router-outlet.?", "vishalgajjar: You may need to structure your app a little differently. You cant have more than one router outlet in a single component. Lets say you have Component A with its child component, Component B, which will hold the tabs. Then you have one <router-outlet> that pulls in your top level components. INSIDE component A you have another <router-outlet> That pulls in and routes to your different tabs"], ["when i run tsc and  will it look for tsconfig.json in the current as well as all parent folders till the root folder of the applicaton ??", "geeky77_twitter:  [<-LINK->]"], ["Hi guys, is anyone here able to answer or give me a hint what's going on with my angular2 app?  Details are posted here: [<-LINK->]"]], "user": [["broweratcognitecdotcom", "notsonotso", "notsonotso"], ["adamgarcia4", "adamgarcia4", "piercers", "adamgarcia4", "piercers", "adamgarcia4", "Toxicable", "adamgarcia4", "adamgarcia4"], ["mkazlauskas"], ["mildfuzz"], ["PhotoPaul", "DzmitryShylovich", "PhotoPaul", "n00dl3", "PhotoPaul"], ["andreasadk"], ["Matteoo7", "Matteoo7", "alxhub", "Matteoo7", "Matteoo7", "alxhub", "alxhub", "Matteoo7", "alxhub", "alxhub", "Matteoo7", "alxhub", "Matteoo7", "Matteoo7", "Matteoo7"], ["Toxicable", "Toxicable", "lazarljubenovic", "Toxicable", "lazarljubenovic", "lazarljubenovic", "Toxicable", "lazarljubenovic", "Toxicable", "lazarljubenovic", "Toxicable"], ["MitchZA", "MitchZA"], ["vincentpalita"], ["brendanjerwin", "brendanjerwin", "michaelpwilson"], ["mijofr"], ["bradysterling"], ["manish7singh"], ["lihaibh", "babeal", "lihaibh", "babeal", "lihaibh", "babeal"], ["lazarljubenovic", "robwormald", "lazarljubenovic", "Toxicable", "lazarljubenovic", "lazarljubenovic", "Toxicable"], ["tomreinartz90", "tomreinartz90"], ["mythz", "DzmitryShylovich", "mythz"], ["npx", "DzmitryShylovich", "npx"], ["matthewhaworth"], ["broweratcognitecdotcom"], ["Toxicable", "DzmitryShylovich", "lazarljubenovic", "DzmitryShylovich", "Toxicable", "robwormald", "Toxicable", "DzmitryShylovich", "Toxicable", "ishitatsuyuki", "ishitatsuyuki", "ishitatsuyuki", "Toxicable", "robwormald", "Toxicable"], ["gargtushar", "gargtushar", "gargtushar", "gargtushar", "gargtushar", "gargtushar", "DzmitryShylovich", "ShadowManu", "gargtushar", "DzmitryShylovich", "gargtushar", "ShadowManu", "Toxicable", "Toxicable", "DzmitryShylovich", "Toxicable", "gargtushar", "Toxicable", "DzmitryShylovich", "gargtushar"], ["jordic", "DzmitryShylovich", "DzmitryShylovich", "jordic", "jordic"], ["TheeRFG"], ["pmulac"], ["edwinharly"], ["maartentibau"], ["harshpatel79", "harshpatel79"], ["thbt"], ["nunofreitasbotelho"], ["win8it", "ericmartinezr", "DzmitryShylovich", "ericmartinezr", "ericmartinezr", "win8it", "win8it", "ericmartinezr", "noamichael", "ericmartinezr", "DzmitryShylovich", "DzmitryShylovich", "ericmartinezr", "win8it"], ["jesmith17", "DzmitryShylovich", "DzmitryShylovich", "jesmith17", "jesmith17", "DzmitryShylovich", "jesmith17", "DzmitryShylovich", "jesmith17", "DzmitryShylovich", "jesmith17", "nikhildhankani", "jesmith17", "jesmith17", "jesmith17"], ["kiokotzu", "kiokotzu", "Toxicable", "kiokotzu", "Toxicable", "kiokotzu", "Toxicable", "kiokotzu"], ["SkyNetDZ", "intellix", "SkyNetDZ", "intellix", "SkyNetDZ"], ["jxxcarlson", "derekkite", "jxxcarlson", "bonnici", "bonnici", "admosity"], ["dgorobopec", "NejcZdovc"], ["broweratcognitecdotcom", "broweratcognitecdotcom", "emilaasa", "emilaasa", "broweratcognitecdotcom", "broweratcognitecdotcom", "broweratcognitecdotcom", "emilaasa", "broweratcognitecdotcom", "broweratcognitecdotcom", "emilaasa", "broweratcognitecdotcom", "broweratcognitecdotcom", "broweratcognitecdotcom", "broweratcognitecdotcom"], ["AlexZan", "DzmitryShylovich", "AlexZan", "DzmitryShylovich"], ["Agi-Developer", "DzmitryShylovich", "DzmitryShylovich", "Agi-Developer", "DzmitryShylovich", "DzmitryShylovich"], ["stefmabo"], ["elliott-beach", "ilennert", "ilennert", "elliott-beach"], ["josephliccini", "ericmartinezr", "ericmartinezr", "ericmartinezr", "josephliccini", "josephliccini"], ["Ranguro"], ["ByMiles", "ByMiles", "bonnici", "ByMiles", "ByMiles", "alxhub", "ByMiles", "ByMiles", "alxhub", "ByMiles", "ByMiles", "alxhub", "ByMiles", "ByMiles", "alxhub", "alxhub", "ByMiles", "ByMiles", "ByMiles", "alxhub", "ByMiles", "ByMiles", "alxhub", "ByMiles", "ByMiles", "ByMiles", "ByMiles", "alxhub", "alxhub", "ByMiles", "ByMiles", "ByMiles", "ByMiles"], ["fplini", "AlpBilgin", "DzmitryShylovich", "fplini", "DzmitryShylovich", "fplini", "alsami", "fplini", "fplini", "DzmitryShylovich", "DzmitryShylovich", "fplini", "DzmitryShylovich", "fplini", "DzmitryShylovich", "DzmitryShylovich", "fplini"], ["achimha"], ["elvisbegovic"], ["seekheart", "Toxicable", "Toxicable"], ["etsuo", "jjstreet", "etsuo", "jjstreet", "etsuo", "etsuo", "jjstreet", "etsuo", "jjstreet", "jjstreet", "etsuo", "etsuo", "jjstreet", "etsuo", "jjstreet"], ["SudeepTavarkhed_twitter", "SudeepTavarkhed_twitter", "Toxicable", "SudeepTavarkhed_twitter"], ["macdasi", "derekkite"], ["frankspin89", "ericmartinezr", "frankspin89", "ericmartinezr"], ["maxime1992"], ["zedz01", "wKoza", "wKoza"], ["foxjazz", "2f4f4f"], ["ellipizle", "Toxicable", "ellipizle", "Toxicable", "ellipizle", "Toxicable"], ["alexisinwork", "intellix", "intellix"], ["WebDevMR"], ["sinedsem", "DzmitryShylovich", "damienwebdev", "robwormald", "Toxicable", "sinedsem", "DzmitryShylovich", "Toxicable", "DzmitryShylovich", "Toxicable"], ["tuomasi", "DzmitryShylovich", "tuomasi", "lazarljubenovic", "tuomasi"], ["urrang", "dklmuc", "urrang", "Martin_Ocando_twitter", "urrang", "Martin_Ocando_twitter", "Martin_Ocando_twitter", "dklmuc", "urrang", "dklmuc", "urrang", "Martin_Ocando_twitter", "urrang", "Martin_Ocando_twitter", "dklmuc", "Martin_Ocando_twitter", "Martin_Ocando_twitter", "urrang", "Martin_Ocando_twitter", "urrang", "Martin_Ocando_twitter", "dklmuc", "dklmuc", "urrang"], ["tuomasi"], ["chrillewoodz", "DzmitryShylovich"], ["losorio2015_twitter", "robwormald", "losorio2015_twitter", "losorio2015_twitter", "robwormald", "losorio2015_twitter", "robwormald", "losorio2015_twitter"], ["fobaz"], ["DirkWolthuis", "ghetolay", "DirkWolthuis", "ghetolay", "DirkWolthuis", "jordic", "DirkWolthuis", "ghetolay", "DirkWolthuis", "jordic", "jordic", "DirkWolthuis", "jordic", "DirkWolthuis", "DirkWolthuis", "ghetolay", "DirkWolthuis", "ghetolay", "DirkWolthuis", "ghetolay", "ghetolay", "DirkWolthuis", "ghetolay", "DirkWolthuis", "jordic", "DirkWolthuis"], ["hazmah0"], ["sayedrakib", "ngmgit"], ["hungerregnuh", "hungerregnuh"], ["achimha"], ["aminsmartsense", "aminsmartsense", "Toxicable", "aminsmartsense"], ["geekrumper", "dklmuc", "geekrumper", "geekrumper"], ["henriquecustodia", "cacogr", "JimLynchCodes", "cacogr", "henriquecustodia"], ["AaronHood", "AaronHood"], ["aminsmartsense", "DzmitryShylovich", "aminsmartsense", "bergben", "aminsmartsense"], ["mike-morr"], ["vishalgajjar", "HauntedSmores", "HauntedSmores", "vishalgajjar", "HauntedSmores"], ["geeky77_twitter", "derekkite"], ["kai-iak"]], "dialog_label": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "sen_label": [["OQ", "QA", "AE"], ["GG", "OQ", "QA", "QE", "QA", "QE", "QA", "AE", "AE"], ["OQ"], ["OQ"], ["OQ", "SA", "PF", "SA", "PF"], ["OQ"], ["GG", "OQ", "QE", "QA", "QE", "QA", "SA", "PF", "SA", "AE", "PF", "SA", "JK", "JK", "UF"], ["OQ", "JK", "QE", "QA", "AE", "AE", "AE", "SA", "UF", "SA", "UF"], ["GG", "OQ"], ["OQ"], ["GG", "OQ", "QA"], ["OQ"], ["GG"], ["OQ"], ["OQ", "SA", "QE", "QA", "QE", "QA"], ["OQ", "QA", "QE", "QE", "QA", "AE", "AE"], ["GG", "OQ"], ["OQ", "SA", "UF"], ["OQ", "SA", "NF"], ["OQ"], ["GG"], ["OQ", "QA", "QE", "QE", "QE", "QA", "QE", "QE", "QA", "AE", "AE", "AE", "AE", "AE", "PF"], ["GG", "GG", "AE", "OQ", "AE", "AE", "QE", "QE", "QA", "QE", "QA", "AE", "QE", "AE", "SA", "QE", "QE", "QE", "AE", "QA"], ["OQ", "QA", "AE", "AE", "AE"], ["OQ"], ["OQ"], ["OQ"], ["GG"], ["GG", "OQ"], ["OQ"], ["GG"], ["OQ", "QA", "AE", "AE", "AE", "GG", "QE", "JK", "QA", "QA", "QA", "JK", "JK", "GG"], ["OQ", "SA", "SA", "NF", "AE", "QE", "QA", "PF", "AE", "QE", "QA", "QE", "QA", "AE", "GG"], ["GG", "OQ", "QE", "QA", "QE", "QA", "QE", "QA"], ["GG", "GG", "OQ", "QE", "QA"], ["OQ", "SA", "UF", "SA", "AE", "NF"], ["OQ", "SA"], ["GG", "OQ", "QA", "QE", "QE", "AE", "AE", "QA", "QE", "QE", "QA", "AE", "UF", "QE", "QA"], ["OQ", "SA", "QE", "SA"], ["OQ", "QA", "AE", "QE", "SA", "SA"], ["OQ"], ["OQ", "QA", "SA", "GG"], ["OQ", "QA", "SA", "SA", "GG", "UF"], ["OQ"], ["GG", "OQ", "SA", "UF", "AE", "QE", "NF", "QA", "QE", "QA", "AE", "QE", "QA", "AE", "PF", "SA", "NF", "JK", "AE", "AE", "AE", "AE", "SA", "UF", "UF", "NF", "AE", "QE", "SA", "PF", "QE", "AE", "QE"], ["OQ", "QA", "SA", "NF", "QE", "QA", "SA", "AE", "UF", "QE", "QE", "QA", "SA", "UF", "AE", "SA", "UF"], ["OQ"], ["OQ"], ["OQ", "SA", "GG"], ["OQ", "SA", "QE", "SA", "PF", "QE", "QA", "AE", "PF", "SA", "PF", "NF", "SA", "PF", "JK"], ["GG", "OQ", "QA", "GG"], ["OQ", "QA"], ["OQ", "SA", "NF", "AE"], ["OQ"], ["OQ", "QE", "SA"], ["OQ", "QE"], ["OQ", "QA", "QE", "QA", "QE", "QE"], ["OQ", "QA", "SA"], ["OQ"], ["OQ", "QA", "QA", "SA", "QA", "AE", "AE", "AE", "AE", "AE"], ["OQ", "QE", "QA", "AE", "NF"], ["OQ", "QE", "QA", "SA", "NF", "SA", "JK", "NF", "AE", "AE", "QE", "QA", "QE", "QA", "AE", "AE", "AE", "QE", "QA", "GG", "AE", "SA", "AE", "UF"], ["OQ"], ["OQ", "SA"], ["OQ", "SA", "AE", "AE", "SA", "PF", "SA", "GG"], ["OQ"], ["OQ", "QE", "QA", "SA", "NF", "AE", "QE", "QE", "QE", "QA", "SA", "PF", "AE", "UF", "PF", "AE", "PF", "AE", "GG", "JK", "AE", "GG", "AE", "AE", "SA", "UF"], ["OQ"], ["OQ", "SA"], ["OQ", "AE"], ["OQ"], ["OQ", "QE", "QA", "GG"], ["OQ", "SA", "NF", "AE"], ["OQ", "QA", "QE", "QA", "UF"], ["OQ", "QE"], ["OQ", "SA", "QE", "QA", "AE"], ["OQ"], ["OQ", "QA", "SA", "QE", "QA"], ["OQ", "SA"], ["OQ"]], "graph_edge": [[[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8]], [0], [0], [[0, 1], [1, 2], [2, 3], [3, 4]], [0], [[0, 1], [1, 2], [2, 3], [2, 4], [4, 5], [4, 6], [6, 7], [7, 8], [8, 9], [8, 10], [10, 11], [11, 12], [12, 13], [11, 14]], [[0, 1], [0, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10]], [[0, 1]], [0], [[0, 1], [1, 2]], [0], [0], [0], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6]], [[0, 1]], [[0, 1], [1, 2]], [[0, 1], [1, 2]], [0], [0], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10], [10, 11], [9, 12], [12, 13], [13, 14]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [3, 6], [3, 7], [6, 8], [7, 8], [8, 9], [9, 10], [10, 11], [10, 12], [12, 13], [10, 14], [10, 15], [15, 16], [16, 17], [16, 18], [17, 19]], [[0, 1], [1, 2], [2, 3], [3, 4]], [0], [0], [0], [0], [[0, 1]], [0], [0], [[0, 1], [1, 2], [2, 3], [3, 4], [1, 5], [1, 6], [6, 7], [6, 8], [6, 9], [6, 10], [9, 11], [11, 12], [8, 13], [9, 13], [10, 13]], [[0, 1], [0, 2], [1, 3], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [6, 8], [8, 9], [9, 10], [10, 11], [11, 12], [12, 13], [13, 14]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7]], [[0, 1], [1, 2], [2, 3], [3, 4]], [[0, 1], [1, 2], [0, 3], [3, 4], [3, 5]], [[0, 1]], [[0, 1], [1, 2], [1, 3], [3, 4], [4, 5], [5, 6], [4, 7], [7, 8], [7, 9], [8, 10], [9, 10], [10, 11], [10, 12], [10, 13], [13, 14]], [[0, 1], [1, 2], [2, 3]], [[0, 1], [1, 2], [2, 3], [3, 4], [3, 5]], [0], [[0, 1], [0, 2], [2, 3]], [[0, 1], [0, 2], [0, 3], [2, 4], [3, 4], [2, 5], [3, 5]], [0], [[0, 1], [1, 2], [2, 3], [2, 4], [4, 5], [5, 6], [5, 7], [7, 8], [8, 9], [9, 10], [10, 11], [11, 12], [12, 13], [13, 14], [13, 15], [15, 16], [16, 17], [16, 18], [18, 19], [19, 20], [20, 21], [21, 22], [22, 23], [22, 24], [22, 25], [25, 26], [25, 27], [26, 27], [25, 28], [26, 28], [28, 29], [28, 30], [30, 31], [28, 32], [31, 32]], [[0, 1], [0, 2], [2, 3], [3, 4], [4, 5], [0, 6], [5, 7], [6, 8], [7, 9], [7, 10], [10, 11], [11, 12], [12, 13], [13, 14], [13, 15], [15, 16]], [0], [0], [[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [3, 4], [3, 5], [5, 6], [6, 7], [7, 8], [7, 9], [9, 10], [9, 11], [11, 12], [12, 13], [13, 14]], [[0, 1], [1, 2], [2, 3]], [[0, 1]], [[0, 1], [1, 2], [2, 3]], [0], [[0, 1], [0, 2]], [[0, 1]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5]], [[0, 1], [0, 2]], [0], [[0, 1], [0, 2], [0, 3], [0, 4], [1, 5], [2, 5], [3, 5], [4, 5], [5, 6], [5, 7], [6, 8], [8, 9]], [[0, 1], [1, 2], [2, 3], [3, 4]], [[0, 1], [1, 2], [0, 3], [3, 4], [4, 5], [5, 6], [5, 7], [7, 8], [8, 9], [9, 10], [10, 11], [11, 12], [12, 13], [13, 14], [13, 15], [15, 16], [13, 17], [17, 18], [18, 19], [19, 20], [19, 21], [21, 22], [22, 23]], [0], [[0, 1]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7]], [0], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [5, 7], [6, 8], [7, 9], [8, 10], [10, 11], [11, 12], [12, 13], [10, 14], [12, 14], [14, 15], [15, 16], [3, 16], [16, 17], [17, 18], [18, 19], [18, 20], [20, 21], [21, 22], [22, 23], [23, 24], [24, 25]], [0], [[0, 1]], [[0, 1]], [0], [[0, 1], [1, 2], [2, 3]], [[0, 1], [1, 2], [2, 3]], [[0, 1], [1, 2], [2, 3], [3, 4]], [[0, 1]], [[0, 1], [1, 2], [2, 3], [3, 4]], [0], [[0, 1], [0, 2], [2, 3], [3, 4]], [0], [0]]}