{"ids": ["xthtnGQh", "mE3ZXsnj", "6tMoO7ex", "DGZlWik0", "rAdy0DJr", "RoOp32ar", "W6G70KEu", "sxqJ9Ols", "dex61hTx", "C3GE8i2n", "WOrZLJje", "f6XL3AN8", "Gan7dGmO", "0pibqFkx", "c8nxKqWt", "RxfKniig", "lv0cyaye", "RKaWqkdo", "4byJmlmg", "D8HLFQOD", "UXsyoAHx", "S3TStig3"], "dialog": [["/aot", "has anyone successfully done aot build following [<-LINK->] ?", "or use the cli", "I was using angular-cli to do aot, then realized that it can't be trusted yet", "2goatduo: there some versioning incompatibilities to watch out for", "@2goatduo why not?", "Toxicable:  [<-LINK->]", "2goatduo: I dont get it", "Toxicable: ng build --aotis doing alot of work, and hiding alot of detail, such as handling of scss files.  I can't easily do an aot build withngc, as suggested here: [<-LINK->] .  Andng build --aotwas succeeding when I had not specified a main.ts with ngfactory bootstrap.   Andngccompile failed on stuff whenng build --aotdidn't, like templates accessing private members of associated classes.", "2goatduo:  [<-LINK->]", "DzmitryShylovich: thanks, but I've been there before"], ["Hi all. ", "Anyone had an error like this before when trying to load a route?\"uncaught (in promise): Error: loading chunk\" 10 failedonly seeing it on IE9, works on everything else as far as I know."], ["noted.", "Chrome 54.0.2840 (Windows 10 0.0.0) DndItem should have original position styling after mouse up[<-CODE->] . i know why that test failed. its still set toposition: absolute. but what i dont understand is why jasmine thinks the position is a blank string?  [<-CODE->]. doesn't seem right to me that it would be blank. when i remove the positioning, the test passes. having to do this kinda sucks :( [<-CODE->] ", "Are you sure the test browser is going to have the same layout as a user browser?  (Just my guess@jjstreet)", "are you asking me?", "Are you styling a custom element,@jjstreet?", "[<-CODE->] is the template for the item im styling. so im grabbing that div", "Ahh. Yeah, not the problem I was thinking of then.", "im not sure i understand your question@daddyschmack. ", "im use chrome as the browser used by jasmine. wonder if i hit another bug with Debug Element", "jjstreet: , I’m just guessing, if you are using the native element, it may not layout the same way in the jasmine plugin renderes, but I’m not sure.. It really is just a guess.", "but what do you mean by layout? im just changing styles and checking styles", "oh, I thought since you’re moving things around with element offset height and element offset width.. that might have caused some kind of issue with the “native element” But again, I’m just pulling this out of my butt.  ", "If you drop a debugger in there, what do you see?", "i was just remarking on how its not ideal to be accessing native element properties in my directive thats all. i dont have any problems yet with offsetHeight and offsetWidth", "jjstreet: , I’m not criticizing!", "lol i never said you were"], ["Hey guys, so i'm trying to use SignalR with my App but im having trouble getting it setup. The issue is that if I put some code to init the connection in my index.html file then it works fineIf I put that same code in my component the variable it's trying to access is undefined, i've tried putting it in a NgZone.run and doing it awhile after the app starts up but it's always undefined [<-CODE->]  [<-CODE->].  [<-LINK->] and I just did it in a plunkr for that and it worked fine >.> I don't see what local stuff im running could break this"], ["Hi guys, ", "I'm having problems with the zone.js. I can't catch an error because there is no catch after the try in zone.js code. Can someone help me, please? [<-CODE->] ", "what are u trying to accomplish?@hardyrz", "Won't the error be caught in the inner try/catch?", "The thing is that is catching one error and throwing another", "It'll only be re-thrown from there if the zone'shandleErrorfunction returns true.", "Yes, it is returning true", "Then that's why it's being re-thrown.", "So, how I can catch it? Because with a simple try/catch i'm not able", "DzmitryShylovich: I want to catch an error in my application but that piece of code is not allowing me. [<-CODE->] "], ["I have a problem with a form validator directive that I created, it seems to not get executed [<-CODE->] The validator looks as follows: [<-CODE->]. Also I noticed that Angular does not error out when I add an unknown attribute to a tag in my template. according to the docs it should error on unknown attributes: [<-LINK->] "], ["Hi guys, strange problem. ", "Using firebase I making a chatbot app. In the oninit cycle I subscribe to the input-observable but first push a welcome message to the firebase list observable. But somehow when I start sending input the items will show up before the welcome message. Is a subscribe function handled first or something?  [<-CODE->]"], ["Why did the documentation left out the whole unsubscribing from route params subscription from the docs. And yet still includes phrases such as \"we\\'ll feed the Observable directly into our template using the AsyncPipe, which will handle unsubscribing from the Observable for us when the component is destroyed\" or \"The router offers a Snapshot alternative that gives us the initial value of the route parameters. We don\\'t need to subscribe or unsubscribe. It\\'s much simpler to write and read:\". These lead one to believe that subscription should be done. But the removal of any reference about that (unlike previously) would indicate that unsubscribing onDestroy is no longer necessary", "PEsteves8: mm because u don't need to unsubscribe from it?", "I appreciate your response, but I feel you didn\\'t really read what I asked. Why does the documentation include expressions like \"the AsyncPipe, which will handle unsubscribing from the Observable for us\" and \"a Snapshot alternative that gives us the initial value of the route parameters. We don\\'t need to subscribe or unsubscribe.\"", "if unsubscription it not needed anyway?", "Why refer that snapshot alternative and async pipe make it unnecessary to unsubscribe, if that what it already happens anyway", "(maybe I wasn't clear before, sorry)", "PEsteves8: file an issue on [<-LINK->] if something is not clear for u. we do not write docs", "snapshot is a plain object", "this is why u don't need to subscibe/unsubscribe", "it's not even possible", "and u don't need to unsubscribe from route observables in general", "because every component has it's own instance of ActivatedRoute", "Right... I know you don't right docs. But I was hoping you were able to help out understanding angular's features. I know that you don't unsubscribe snapshot, that's pretty easy to understand. My point is, why the emphasis on the wonders of using methods that allows to skip unsubscribing, if that already happens?", "And I\\'m just going to assume that that emphasis shouldn\\'t be there and that it\\'s a bit misleading. and \"We don\\'t need to subscribe or unsubscribe\", could be changed to just \"We don\\'t need to subscribe\"", "*write docs", "file an issue on https://github.com/angular/angular.io/issues and they will explain/change it better", "ok", "PEsteves8: they emphasize it, because it is important... For me it's absolutly clear and logical", "base rule is: when you subscribe then you also need to unsubscribe... all other thins are exceptions from that rule", "dklmuc: Ah yes. But I was told here that router params unsubscribe is done anyway on component destruction, without any need to do it explicitly using the onDestroy hook.", "PEsteves8: really? that's new for me...", "dklmuc: I was told that here, after I asked why the recommendation to unsubscribe using the onDestroy hook was removed from the docs. But I still feel a bit confused from the things I just asked a couple of minutes ago.", "PEsteves8: confusion always depends who you ask...", "I'll just focus more on the docs repo for things like these", "PEsteves8: the skill level of some people is really high, but their level of social skills is exactly the opposite...", "dklmuc: In case you\\'re interested, regarding the whole router params unsubscribing thing from yesterday, I finally got clarification here: [<-LINK->] Summarizing: \"I see your point. Not having to unsubscribe was a virtue of snapshot. Now it isn\\'t. Not having to subscribe remains a snapshot virtue. I\\'ll update prose accordingly.\" :D"], ["Are there any known issues with ngIf rendering on IE? I have a really simple ngIf that just checks a boolean that gets flipped by a function in the component. Works great everywhere except IE."], ["Okay Gentlemen,  We have a button that doesn’t get enabled until certain required fields are not ng-invalid and not ng-pristine.. We have to go there and manually update those fields to trigger the button to become active.  HOWEVER, we populate these select controls with VALID values on the ngInit event.  Why are they not being set to valid and touched then?"], ["[<-LINK->]. Am I doing something wrong here or is this a bug o.O", "RicardoVaranda: depends.. what are you trying to do? ", "RicardoVaranda: If it's about that value=\"{{food.name}}\".. that\\'s a bug, already fixed, merged, but not released yet", "bboehm86: Thanks thats exactly what I was referring to :)", "Would you mind linking the PR?"], ["hi all", "Morning", "is there a way to avoid the first router transition? I am using universal and the server renders the view. When the browser side angular kicks in. It starts with a transition animation. This look strange because universal already rendered the view."], ["Hey guys. Just tried to upgrade angular from 2.4.2 to 2.4.5 but now I keep TS2339: Property 'map' does not exist on type 'Observable<Response>' errors even if I have import 'rxjs/add/operator/map'; set. Any ideas?", "apparently the operator is not imported where it should. I have seen those errors as sporadic, sometimes it complains, sometimes it doesn't.", "@achimha I have created file rxjs-extensions.ts and I do import './rxjs-extensions'; in app.module.ts. In 2.4.2 works fine, but in 2.4.3+ I can't start server", "do it in main.ts", "@GuskiS did you also update rxjs", "@achimha Will try. ", "@lazarljubenovic I'm using 5.0.3 - the same version as for 2.4.2 angular", "Still failing in main.ts", "@GuskiS There should be a problem somewhere else. Can you try to import and use map by this way?", "@GuskiS ... I think that it is related to some third party lib. Did you change something from this point of view when upgrade?", "GuskiS: did you change the typescript version?", "yes, from 2.1.4 to 2.1.5, but I switched back and same result", "GuskiS: Angular dosent support 2.1 yet", "stay with angular typescript version", "\"typescript\": \"^2.0.10\"", "without the ^", "when you try to upgrade any dependency  make sure other libraries are using the latest or the version you are upgrading to", "Angular dosent support 2.1 yet.  [<-ISSUE->]. 2.1 had a breaking change", "But it was working with 2.1.4, why is that?", "therefore Angular cant upgrade without a breaking change. being 4.0. Therefore it wont be in till the next Major version", "GuskiS: I don't know but Angular still dosn't support it", "yeah it may work but once you go deep in coding you will start seeing exceptions", "Toxicable: also this repo is using 2.1.5 [<-LINK->] ", "GuskiS: to know why check the TS 2.1 DOCS and see the changes. compare it with what angular is supporting then you will know the problems you are getting and why", "switched to typescript 2.0.10 - 183 errors :("], ["same issue was here though [<-LINK->] which you can still see here [<-LINK->]. when you check it in the console, in the form builder example on the bottom, “description” input is filled in, but its got “ng-invalid” class and I’m pretty sure if you logged out form.value.description it would be empty", "@fxck can you submit an issue for the simple ngControl=\"\" [value]=\"\" case?", "I’m still not sure whether its a bug or I’m just doing something wrong, maybe ngModel is requirement when you want ngControl to work properly", "@fxck imo it's a bug in angular that your plunk doesn't work. I mean, it is technically working, but it's not working as expected."], ["Can anyone explain why <router-outlet></router-outlet> alone results in a blank page but [<-LINK->] results in the router working properly?", "@BlueHayes that's a bug in the new router, the new new router"], ["I am not sure if this is a system.js bug, jspm bug, or a bug in my brain, but all is working great when I was on commonjs in my jspm.config.js, not I am trying to make a switch over to system so I can use hot-reload, but everything blows up. this is the change I did:[<-CODE->]. and it all exploded with [<-LINK->]. any ideas?"], ["Is there anyone here who's used SSR in production? I'm noticing something weird where a bug will occur in rendering (usually in the ngOnDestroy method) that for the life of me makes no sense (unless ngOnDestroy is firing before ngOnInit). And when I restart the node instance running SSR the error miraculously stops happening"], ["Hello guys,  ", "is this a bug, or do you know a workaround for the following problem? Imagine you have the following webcomponent: [<-CODE->]. The component reads the text inside the script tag and sends it to a server which evaluates the result. The webcomponent should be embedded in an Angular App. It is no Angular component and should just rendered as is. It has contain a script tag, because 'text/plain' allows it not to be parsed as html and like this it is possible for expressions to contain characters like < as in var1 < var2 without being recognized as the beginning of a html tag. But Angular deletes all script tags inside templates, also those with text/plain. I read, that this is because you shouldn't mix JavaScript with Angular Templates, but this is just plain text.  Is there a workaround. Is it a bug?", "@AlexanderJohr ,here you go. Let me know if this answers your question. [<-LINK->]"], ["@jancoow Hi guys. ", "I've a really weird scrolling bug. When I want to scroll down on a page, right after switching to it, the page automaticly scrolls up. So you can't scroll down for like ~5 seconds (you see it flashing \"down\" but it pops right to the top). After the 5 seconds scrolling works fine again. Until you switch to another page.. What could be the problem, and how can I investigate it? I think the bug appears after upgrading to Angular 6", "do a find all in your code for scrollHeight, scrollTop, if that doesn't track it down set a breakpoint on scrollEvents and ignore the down scrolls", "@sliceofbytes thanks will try that!", "@sliceofbytes how would I actually set breakpoints on scroll events?", "I'm using chrome", "@jancoow [<-LINK->]", "@sliceofbytes can't it just make a list of function calls or something, instead of pause? Because this is really frustrated to debug ;p", "@jancoow just add an event listener in your code", "@sliceofbytes and then what?", "log, or do whatever you want. Easiest way is to look at where your code is touching scroll. instead of hooking all scroll but as a last resort hook the scroll event [<-CODE->]", "yeah I find 100 of scrollHeight or scrollTop, 100 times *", "I'm not sure how to help you debug more without seeing code. Add logging / breakpoints to anywhere your code could possibly touch scroll or height of the element in question and look at the logs to narrow down the area of code its happening in. somewhere in your code or a library you are using the height or scroll of the element in question is being changed.", "yeah exactly,It could be the theme, ", "Can't I add an event listener to check if for exmaple window.scrollTo() is called?", "@jancoow this is the best I can do without seeing your code.[<-LINK->]", "then look at the stack when debugger pauses and figure out which part is the culprit. Also I just found this which is pretty cool but maybe not useful for this.  [<-LINK->]", "okay cool so I do see the \"up\" is triggered, and I have the event data. ", "now I need to find where it get the call from this shoudl be available in the event data?", "no look at the stack", "problem is that scroll up is always happening on page switch ugh. so hard to stack and the problem only happends after ~4 page switches", "ugh;;", "Well either way if it's a programatic scrollUp, it should be in the call stack close to the event handler", "yeah, Weird thing is the more you page switch the more it happends ugh"], ["I filed a bug today but I want to make sure with you that it really is a bug and not my error: [<-ISSUE->]. Can anyone tell me if I'm flushing my request wrong here: [<-CODE->]. My test passes successfully the first time I run it, but each time after that it fails with the error: Error: Expected one matching request for criteria \"Match method: GET, URL: (any)\", found none.. Why would the exact same test succeed once, then fail the next time? I think it might be a problem with the way I'm flushing my HTTP requests, maybe I'm not cleaning up properly and leaving some requests \"hanging\". Any ideas? Every service test I write using the same general pattern (req.flush) is exhibiting this same buggy behavior, so maybe it's me."], ["I've encountered a weird bug when using @Optional() and Observables. I've made a plunkr here: [<-LINK->] The request fails and the console prints an error 'Observable_1 is not defined'. If you remove the @Optional() then it works just fine. Is there a reason for this or is it a bug?"], ["Hey, ran into an interesting bug, and I’m not sure this is just my problem, or ng-bootstrap’s problem, or a best practices problem, or some combination. Here is an example of the bugged code, which came indirectly from a project I’m working on that inexplicably broke between ng-bootstrap alpha 5 and 6: [<-LINK->]", "what is it anyway i have no idea lol, lemme check. oh an editor. just use a textarea! :P. ", "that's horrible", "See the problem? The issue was *ngFor = “let dropdown of menu”. dropdown clashed with a variable name in the ngbDropdown package.", "So the question is: should we have known better than to use dropdown as a name? should ng-bootstrap be prefixing its local variables so that this sort of thing won’t be an issue?", "@karptonite technically it needs a dash to be valid html anyway, i suggest prefixing your own components", "@karptonite oh, the variable name clashed? sorry i misread though it was component name clash", "Yes.", "hah, funny", "variable name clashed. it took me an embarrassingly long time to figure that out.", "@karptonite first time seeing a case like this, i think nobody prefixes their variable names. it's amazing you did figure it out, it'd never cross my mind lol. ", "how can dat clash anyway? that variable is scoped to the template", "I’m open to theories, but that is definitely the issue.", "note that I use dropdown inside the ngbDropdownToggle element, and that is where the clash happens, I think.", "it's still very weird, i don't think that's intended behvaiour. it should still give you a sensible error", "So is this an Angular bug?", "well i cannot speak for the team, but from what you described, i'd totally say it needs some working. at the very least, a sensibile error message", "If so, I’d like to report it properly, but I don’t know what a good minimal example would be.", "maybe wait to see if someone can figure out exactly how the clash is happening first, since i'm kinda dumbfounded", "I don’t know if it is a bug, honestly. Here is the relevant code in the ng-bootstrap library: [<-LINK->]"]], "user": [["2goatduo", "2goatduo", "Toxicable", "2goatduo", "piq9117", "Toxicable", "2goatduo", "Toxicable", "2goatduo", "DzmitryShylovich", "2goatduo"], ["ChrisGrant", "ChrisGrant"], ["jjstreet", "jjstreet", "daddyschmack", "jjstreet", "alxhub", "jjstreet", "alxhub", "jjstreet", "jjstreet", "daddyschmack", "jjstreet", "daddyschmack", "daddyschmack", "jjstreet", "daddyschmack", "jjstreet"], ["Toxicable"], ["hardyrz", "hardyrz", "DzmitryShylovich", "alxhub", "hardyrz", "alxhub", "hardyrz", "alxhub", "hardyrz", "hardyrz"], ["achimha"], ["DirkWolthuis", "DirkWolthuis"], ["PEsteves8", "DzmitryShylovich", "PEsteves8", "PEsteves8", "PEsteves8", "PEsteves8", "DzmitryShylovich", "DzmitryShylovich", "DzmitryShylovich", "DzmitryShylovich", "DzmitryShylovich", "DzmitryShylovich", "PEsteves8", "PEsteves8", "PEsteves8", "DzmitryShylovich", "PEsteves8", "dklmuc", "dklmuc", "PEsteves8", "dklmuc", "PEsteves8", "dklmuc", "PEsteves8", "dklmuc", "PEsteves8"], ["nanomoffet"], ["daddyschmack"], ["RicardoVaranda", "bboehm86", "bboehm86", "RicardoVaranda", "RicardoVaranda"], ["BenjaminHofstetter", "Toxicable", "BenjaminHofstetter"], ["GuskiS", "achimha", "GuskiS", "achimha", "lazarljubenovic", "GuskiS", "GuskiS", "GuskiS", "mlc-mlapis", "mlc-mlapis", "derekkite", "GuskiS", "Toxicable", "JefferyHus", "derekkite", "derekkite", "JefferyHus", "Toxicable", "GuskiS", "Toxicable", "Toxicable", "JefferyHus", "GuskiS", "JefferyHus", "GuskiS"], ["fxck", "PascalPrecht", "fxck", "escardin"], ["BlueHayes", "ericmartinezr"], ["born2net"], ["exavior75"], ["AlexanderJohr", "AlexanderJohr", "aakashgarg19"], ["jancoow", "jancoow", "sliceofbytes", "jancoow", "jancoow", "jancoow", "sliceofbytes", "jancoow", "sliceofbytes", "jancoow", "sliceofbytes", "jancoow", "sliceofbytes", "jancoow", "jancoow", "sliceofbytes", "sliceofbytes", "jancoow", "jancoow", "sliceofbytes", "jancoow", "jancoow", "sliceofbytes", "jancoow"], ["jplew"], ["Daimonos"], ["karptonite", "lazarljubenovic", "lazarljubenovic", "karptonite", "karptonite", "lazarljubenovic", "lazarljubenovic", "karptonite", "lazarljubenovic", "karptonite", "lazarljubenovic", "lazarljubenovic", "karptonite", "karptonite", "lazarljubenovic", "karptonite", "lazarljubenovic", "karptonite", "lazarljubenovic", "karptonite"]], "dialog_label": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], "sen_label": [["JK", "OQ", "SA", "NF", "AE", "QE", "QA", "NF", "AE", "SA", "NF"], ["GG", "OQ"], ["JK", "OQ", "QE", "QE", "QE", "QA", "AE", "QA", "AE", "AE", "QE", "QA", "QE", "QA", "AE", "AE"], ["OQ"], ["GG", "OQ", "QE", "QE", "QA", "AE", "PF", "AE", "QE", "QA"], ["OQ"], ["GG", "OQ"], ["OQ", "QE", "QA", "QE", "QE", "AE", "RA", "AE", "AE", "AE", "AE", "AE", "AE", "AE", "AE", "RA", "GG", "AE", "AE", "AE", "QE", "QA", "AE", "AE", "AE", "AE"], ["OQ"], ["OQ"], ["OQ", "QE", "AE", "SA", "RA"], ["GG", "GG", "OQ"], ["OQ", "QA", "NF", "SA", "QE", "UF", "QA", "NF", "QE", "QE", "QE", "QA", "AE", "SA", "AE", "JK", "AE", "AE", "QE", "AE", "QA", "QA", "AE", "SA", "NF"], ["OQ", "RA", "UF", "AE"], ["OQ", "QA"], ["OQ"], ["OQ"], ["GG", "OQ", "SA"], ["GG", "OQ", "SA", "UF", "QE", "AE", "QA", "QE", "QA", "QE", "QA", "PF", "SA", "PF", "QE", "QA", "SA", "PF", "QE", "QA", "AE", "JK", "AE", "GG"], ["OQ"], ["OQ"], ["OQ", "QA", "AE", "AE", "QE", "QA", "QE", "QA", "AE", "AE", "AE", "QE", "QA", "AE", "AE", "QE", "QA", "AE", "AE", "AE"]], "graph_edge": [[[0, 1], [1, 2], [2, 3], [3, 4], [3, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10]], [[0, 1]], [[0, 1], [1, 2], [2, 3], [1, 4], [4, 5], [5, 6], [2, 7], [7, 8], [8, 9], [9, 10], [10, 11], [10, 12], [12, 13], [13, 14], [14, 15]], [0], [[0, 1], [1, 2], [1, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [2, 9]], [0], [[0, 1]], [[0, 1], [1, 2], [1, 3], [1, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10], [10, 11], [11, 12], [12, 13], [13, 14], [14, 15], [15, 16], [0, 17], [0, 18], [17, 18], [17, 19], [18, 19], [19, 20], [20, 21], [21, 22], [22, 23], [23, 24], [24, 25]], [0], [0], [[0, 1], [0, 2], [1, 2], [2, 3], [3, 4]], [[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [0, 4], [2, 4], [2, 5], [4, 6], [3, 7], [7, 8], [7, 9], [8, 9], [7, 10], [10, 11], [11, 12], [11, 13], [11, 14], [13, 14], [14, 15], [13, 16], [11, 16], [12, 17], [17, 18], [17, 19], [18, 20], [18, 21], [20, 22], [22, 23], [14, 24]], [[0, 1], [1, 2], [2, 3]], [[0, 1]], [0], [0], [[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [2, 4], [4, 5], [4, 6], [6, 7], [7, 8], [8, 9], [9, 10], [2, 11], [11, 12], [12, 13], [12, 14], [14, 15], [15, 16], [16, 17], [16, 18], [17, 18], [18, 19], [19, 20], [20, 21], [20, 22], [22, 23]], [0], [0], [[0, 1], [1, 2], [1, 3], [3, 4], [4, 5], [4, 6], [6, 7], [7, 8], [8, 9], [9, 10], [9, 11], [11, 12], [12, 13], [13, 14], [14, 15], [15, 16], [16, 17], [17, 18], [18, 19]]]}