{"ids": ["RXxMnbbk", "VF2hapCN", "xyX5Q2uA", "4rSWszY0", "lBP4JxB9", "18GIuUYt", "doRib3kj", "x9XVkIBw", "9DgcINXc", "dOKZtEko", "ABdxPLIV", "wbK3DC91", "cXK8uRZm", "oE6pU3kb", "NARatASt", "odJOSkXz", "sfpVgCw2", "wlIOk37I", "cgnHeNjg", "YxMJ3wWa", "xLI1cfPV", "a1hE18km", "sQhoKt0o", "PjBzGnAe", "SdT8dXVX"], "dialog": [["anyone know why appium 1.5.3 will not work with my android emulator? It worked prior to 1.5.3", "blueice349: app is nnot launching ?", "yes its not I have been trying to firgure out what is wrong, it works on Android Device"], ["The problem I faced with Protractor is, as soon as it invokes app, it immediately tries to inject protractor javascript into webview. in cases of splash screen or 1st screen as native screen, injection of protractor script fails due to absence of any webview. if you can dump the appium log here, that would be helpful", "Same thing I was am facing.. I added caps.setCapability(\"appWaitActivity\", \"your Main activity name\");", "but this is for java + appium not sure if you can do it in protractor..", "what do u get in the server log?", "[<-CODE->] It was stopping server at launch.. and it was random... sometime it used to launch app successfully and sometimes it was showing me above issue.."], ["Hello, all!", "I'm having some trouble trying to scale my Appium tests and I'm interested in hearing from people who are running multiple Appium servers for running tests in parallel.My initial idea was to run appium on Docker on cloud machines for Android but that didn't work since I was only able to run arm on cloud and it's too slow for my needs. For iOS I didn't come up with anything other than handling multiple machines/devices myself or paying for a solution like SauceLabs.Has anyone solved this in another way and can share how you are doing it?", "try this [<-LINK->]", "This looks good, but it seems to solve the issue of running the same tests across multiple different devices. ", "My goal is to actually speed up the test execution by parallelizing the execution of a same test suite across multiple appium servers.", "We have about 300 jbehave tests using Appium and they are taking near 7 hours to complete and this is just too much. BTW, does this look reasonable to you guys? 300 Appium tests in 7 hours?", "i had file an appium support issue where on ios after upgrading to XCUITestDriver my test runtime has more than doubled", "i have around 100 tests which take almost 3 hours on ios so 300 tests in 7 hours aligns along those lines. android is much faster though. earlier android used to be hella slow", "i don't know of any solution for ios other than what you are doing with multiple machines, OS limitation i guess", "hardik-d: @RatkoD thanks for your inputs!", "[<-LINK->] go add your comment@ckilesse-daitan"], ["I am writing multiple test , so while starting second test it gives me thisorg.openqa.selenium.SessionNotCreatedException: A new session could not be created. Details: Problem getting session data for driver type AndroidDriver; does it implement 'get driverData'? (WARNING: The server did not provide any stacktrace information)Do I need to  instantiate again", "can you try with override session in appium server...", "tekisrinivas20: Does not work , still closes the app after first testcase method"], ["RatkoD: did the parallel framework work with ios 10 ?", "i could not make it work with two ios 10 devices, probably because of problems with signing of the webdriver"], ["PeterGolf: hi all!Does any one have problems with finding elements in ios application with ios driver?appium version 1.6.3i can see element on screen of devicebut when i'm making getPageSource - cant find them"], ["Is Appium 1.6.3 supposed to be able to run multiple Android emulators concurrently assuming I use separate Appium server instances? Whenever I try to do it, Appium just cannot seem to handle it. For example, one server instance is supposed to handle one emulator but then it telnets into the other emulator or something. Maybe that's not even it, but it tries to do something with both emulators. Despite using different server ports, bootstrap ports, chrome driver ports, even UDID (whether it makes a difference or not) Not just that. I actually cannot even reliably run tests on two different emulators sequentially. Sometimes works, sometimes not. All these problems lead me to think that Appium is not meant to support it, even through I have read various places that one can do it anyway.", "i used to do it previously, haven't tried on 1.6.3", "\"Despite using different server ports, bootstrap ports, chrome driver ports, even UDID (whether it makes a difference or not)\" this is must [<-CODE->]", "Thanks for replying", "this is what has worked before, check the ports i am using. they have to be 10# apart from one instance to another", "Hmm. Isn't -U the same as --udid ?", "of course i use UDID and PORT in my caps", "Sorry", "yes but you start your server and tell it the UDID and have to tell your test code the same", "When I run my tests, I have emulators with UDID \"emulator-5554\" and \"emulator-5556\". How do I know what to tell Appium? Or does the parameter set the UDID in the emulator as well?", "in ruby", "Hmm. Not sure what that appium_lib is so I will check that out. Maybe I could just put the UDID inside my \"default-capabilities.json\" file?", "so basically you have to tell your driver to talk to which port, figure ^^ out in whatever appium client lib you are using", "you using java/python/js?", "Python", "I tried to set the UDID to something random so maybe that is the problem.", "k", "I just do not know what/who decides what the UDID of the emulator will be.", "If it's Appium then maybe it will work.", "server has to know exact UDID to talk to and your driver  has to know what UDID and appium port to talk to", "UDID is unique per device/emulator has nothing to do with appium", "So maybe it's set when I create the AVD then", "yes", "Okay I will try :D", "if your emulator/avd is running, typing adb devices should give you the UDID", "Thank you, Hardik! I will be right back. Need to switch from Windows to macOS where I do the development/testing.", "Hmm. I do not think it worked out the way I expected.", "I launched one emulator (Android 5.1) andadb devicesgave me \"emulator-5554\". Then I quit the emulator and launched another one (Android 7.1). This time,adb devicesalso gave me \"emulator-5554\".", "If I then start up the first emulator again (Android 5.1), its UDID appears to be \"emulator-5556\".", "I don't know but maybe this is a problem for Appium?", "I have an idea. I can try to use the avdArgs capability to pass the \"-port\" parameter to the emulator. \"Set the console port number for this emulator instance to <port>. The console port number must be an even integer between 5554 and 5584, inclusive. <port>+1 must also be free and will be reserved for adb.\" That may make the UDID consistent at least.", "In the end, I decided to create an issue on GitHub: [<-ISSUE->]"], ["not able to run appium test in iOS real device with os 10.1.1, Appium version 1.6, xcode 9. anything to install. Also I able to run appium in iOS simulator by installing  'brew install carthage'"], ["is anyone else facing this issue: [<-ISSUE->]"], ["hi :)", "I'm using appium 1.6 on real iOS 9 device and the app launch twice for the appium session. is this the expected behaviour? I only call 'launch' once in my appium client"], ["hi", "I'm using appium 1.6 on real iOS 9 deviceand the app launch twice for the appium sessionis this the expected "], ["Hey guys, ", "does anyone knows a solution for the Too many instances of this service are already running error. it happens all the time, even after just a few tests, and I need to reboot the tested device and it's a pain in the ass to do this all the time. or nobody here is using appium 1.6+ because it's actually unusable with all the bugs and things not working"], ["anyone updated to the new itunes?  I have a suspicion its broke appium’s ability to talk to safari on real devices", "i haven't, its knocking on the door"], ["hi", "[<-CODE->] plz help me solve this error.", "is this all on the same machine? ECONNREFUSED suggests something couldn’t reach something else on the network", "hazmeister: ys, try to run in single device only"], ["[<-CODE->] I got this error while trying to automate an hybrid app. Please help", "@Rahul-Chulliparambil post your caps here?", "caps means?", "desired capabilities", "Ok [<-CODE->] ", "Do we have to do any configuration in appium? apart from selecting the folder of apk and device name etc. ?", "No I am speaking wrt Capability", "Ok.. But I will add those capabilities from you as well and try.", "[<-CODE->] try this it will work", "Thanks. Let me try.@Divya-tfw", "cool", "Divya-tfw: What is the purpose of this line ?", "[<-CODE->] When I am running my appium server finally i am getting this error: error: Could not pre-launch appium: Error: Permission to start activity denied.Appium server process ended"], ["Hello, ", "can anyone say me why appium 1.11.1 with uiautomator2 works so slowly? With appium 1.10.1 it was so faster, but was ploblems with Unable to create a new remote session. Please check the server log for more details. Original error: An unknown server-side error occurred while processing the command. Original error: Could not proxy command to remote server. Original error: Error: read ECONNRESET. And i red what in 1.11.1 this bug will be fixed, but now in some tests i have the same problem can you say me what i do wrong?)) emulator ANDROID 8.1. my capabilities [<-CODE->]. ", "my locators like this [<-CODE->]"], ["Hi, In the latest version of appium (1.4.1), I am unable to search an element via UI Automator Selector (Android). Is this a known bug by any chance?"], ["Hey guys, ", "does anyone know if it's possible to simulate drawing shapes via Appium's TouchActions. I tried to chain moveTo actions (see below) and then call myAction.release.perform, but it looks like the gesture is not implemented/supported. [<-CODE->]", "@JoelWhitney , u should be able to do it using touch actions", "@aniket-21 thanks for the reply. So the thinking is something like below should work? [<-CODE->]", "@JoelWhitney what version of appium? [<-CODE->] works fine for me on 1.6.4", "@hardik-d I'm trying to concatenate multiple moveTo actions. Simulating drawing a line from a-->b works as expected. However, I'd like to move from a-->n without releasing finger", "haven't tried that", "but if its not working, you know why. just curious, why would you need to do that", "@hardik-d in case you didn't see my original post (see below). I'm trying to implement a ui test for a feature in my app that allows users to draw on the screen. I want simulate this by drawing circle, square, blob, etc. Once you pick up your finger the geometry is complete", "yeah sorry to have jump the gun, seems like a feature request on appium github. @JoelWhitney have you tried MultiTouch action [<-LINK->]", "look at the \"MultiTouch\" section, not ideal but the way things are performed is similar to what you want with single finger. end result could be same, if at all [<-CODE->] works.", "implemented above sudo code and got same Selenium::WebDriver::Error::UnknownError:. Support for this multi-action is not yet implemented. Please contact an Appium dev.", "@JoelWhitney , i don't see a reason why chained moveTo statements should not work. If it isn't working it's a bug", "@aniket-21 @hardik-d thanks guys, I'll report a bug as looks like this isn't working"], ["hello all, Please help me.. ", "I am not able to download and install appium in my PC. I m very new to appium. My Operating system is UBUNTU 16.04. Please help", "[<-LINK->]", "I tried this link .. still having problem", "what sort of problem? here is another useful discussion [<-LINK->]", "Some warning are coming [<-CODE->] like these", "its a bug i think  [<-LINK->] see post. Georgios Vasileiou (ge-vasiliou) wrote on [<-ISSUE->]. Same problem here with Ubuntu Gnome 16.04. Just notice that this problem appears only when i sudo. No sudo ,no problem."], ["Hi, ", "does somebody know if this issue [<-ISSUE->] got actually fixed on version 1.5.3? a comment there says that the fix was going to be applied on next version, which by the time of the comment should be 1.5.3, but I'm still experiencing the same issue on the latest version", "@sbustosm Possibly a bug on the appium (not the appium OSX app) side. Also note a lot of times app object visibility is limited at the OS level which is why clearly visible objects can be marked as visible=false."], ["Hey all. ", "I know this is probably bad practice but I wanted to post an issue here... The reason is because I don't know if it is in UIAutomator2, Appium, or Android iteself, either way it is a pretty bad bug IMHO. However, it also could be a \"do this\". [<-ISSUE->]"], ["Hi here, ", "can anybody here can confirm my assumption that Appium 1.9.1 has a bug with \"/timeouts\" endpoint on iOS , I see the following error: Parameters were incorrect. We wanted \"MJSONWP protocol requires type and ms\" and you sent {\"script\":1000}"], ["Hey all, ", "just wanted to find out if anyone knew of the issue when calling attempting to get the location of a Selenium Element inside of Ruby… We are using Capybara and when we get the Seleniuim Element from the Capybara Element and call “location”, “size”, or “rect” the request to endpoint fails with MethodNotYetImplemented, I am using the latest Ruby bindings and Appium 1.8.1, were these changed as part of W3C compliance. I will start writing up the bug if no one feels it rings a bell. However, I wanted to make sure as it seems like it is a pretty large issue for anyone working with touch targets or coordinate extraction."], ["Hi all. ", "Someone can explain why the instances of ByIdOrName class are created here? It's .NET implementation. [<-CODE->]. I think it implementation fires this bug [<-ISSUE->]"], ["so I created a custom function for using sendKeys()...[<-CODE->]. Seems to work great, but one out of say 20 runs it misses a key on android any reasons why this would happen? I tried to add click() and sleep() to slow the process down and still did not help..", "here is an example how I call the sendKeys function...[<-CODE->].", "@blueice349 I have noticed a similar problem with certain Android devices (HP and Samsung), there seems to be a bug with sendkeys. The least problematic for me has been the Nexus 7 if you're looking for a workaround. I filed a bug against this about 5 months ago, it hasn't gotten any traction.", "Thank you sir..."]], "user": [["blueice349", "shabinmohan", "blueice349"], ["coding-yogi", "jeevanbhushetty", "jeevanbhushetty", "coding-yogi", "jeevanbhushetty"], ["ckilesse-daitan", "ckilesse-daitan", "RatkoD", "ckilesse-daitan", "ckilesse-daitan", "ckilesse-daitan", "hardik-d", "hardik-d", "hardik-d", "ckilesse-daitan", "hardik-d"], ["rohantilekar", "tekisrinivas20", "rohantilekar"], ["saikrishna321", "RatkoD"], ["PeterGolf"], ["SteffenL", "hardik-d", "hardik-d", "SteffenL", "hardik-d", "SteffenL", "hardik-d", "SteffenL", "hardik-d", "SteffenL", "hardik-d", "SteffenL", "hardik-d", "hardik-d", "SteffenL", "SteffenL", "hardik-d", "SteffenL", "SteffenL", "hardik-d", "hardik-d", "SteffenL", "hardik-d", "SteffenL", "hardik-d", "SteffenL", "SteffenL", "SteffenL", "SteffenL", "SteffenL", "SteffenL", "SteffenL"], ["premji9892_twitter"], ["hardik-d"], ["guysegal", "guysegal"], ["guysegal", "guysegal"], ["RatkoD", "RatkoD"], ["hazmeister", "hardik-d"], ["bhargav2410", "bhargav2410", "hazmeister", "bhargav2410"], ["Rahul-Chulliparambil", "mgmanikandan87", "Rahul-Chulliparambil", "mgmanikandan87", "Rahul-Chulliparambil", "Rahul-Chulliparambil", "Divya-tfw", "Rahul-Chulliparambil", "Divya-tfw", "Rahul-Chulliparambil", "Divya-tfw", "Rahul-Chulliparambil", "Rahul-Chulliparambil"], ["DaniilMoiseevPenza", "DaniilMoiseevPenza", "DaniilMoiseevPenza"], ["Rohthebroh"], ["JoelWhitney", "JoelWhitney", "coding-yogi", "JoelWhitney", "hardik-d", "JoelWhitney", "hardik-d", "hardik-d", "JoelWhitney", "hardik-d", "hardik-d", "hardik-d", "coding-yogi", "JoelWhitney"], ["DIVYASHIKHA_twitter", "DIVYASHIKHA_twitter", "hmdarsh", "DIVYASHIKHA_twitter", "hmdarsh", "DIVYASHIKHA_twitter", "hmdarsh"], ["sbustosm", "sbustosm", "TFry"], ["mikesalvia", "mikesalvia"], ["pablopaul", "pablopaul"], ["mikesalvia", "mikesalvia"], ["OlegYanush", "OlegYanush"], ["blueice349", "blueice349", "TFry", "blueice349"]], "dialog_label": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], "sen_label": [["OQ", "QE", "QA"], ["OQ", "QA", "AE", "QE", "QA"], ["GG", "OQ", "SA", "NF", "AE", "AE", "AE", "AE", "AE", "GG", "RA"], ["OQ", "SA", "NF"], ["OQ", "QA"], ["OQ"], ["OQ", "QA", "AE", "GG", "SA", "QE", "QA", "GG", "AE", "QE", "QA", "QE", "QA", "QE", "QA", "AE", "JK", "AE", "AE", "AE", "AE", "QE", "QA", "UF", "SA", "UF", "NF", "AE", "AE", "QE", "AE", "AE"], ["OQ"], ["OQ"], ["GG", "OQ"], ["GG", "OQ"], ["GG", "OQ"], ["OQ", "QA"], ["GG", "OQ", "QE", "QA"], ["OQ", "SA", "QE", "QA", "PF", "QE", "QA", "UF", "SA", "UF", "AE", "QE", "NF"], ["GG", "OQ", "QA"], ["OQ"], ["GG", "OQ", "SA", "UF", "QE", "QA", "AE", "QE", "QA", "QE", "AE", "AE", "AE", "UF"], ["GG", "OQ", "SA", "NF", "QE", "QA", "AE"], ["GG", "OQ", "QA"], ["GG", "OQ"], ["GG", "OQ"], ["GG", "OQ"], ["GG", "OQ"], ["OQ", "AE", "QA", "GG"]], "graph_edge": [[[0, 1], [1, 2], [2, 3]], [[0, 1], [1, 2], [2, 3], [3, 4]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [1, 6], [6, 7], [7, 8], [8, 9], [9, 10]], [[0, 1], [1, 2]], [[0, 1]], [0], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10], [10, 11], [11, 12], [12, 13], [13, 14], [14, 15], [15, 16], [16, 17], [16, 18], [18, 19], [19, 20], [20, 21], [21, 22], [22, 23], [23, 24], [24, 25], [25, 26], [25, 27], [27, 28], [28, 29], [29, 30], [30, 31], [31, 32]], [0], [0], [[0, 1]], [[0, 1]], [0], [[0, 1]], [[0, 1], [1, 2], [2, 3]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10], [10, 11], [11, 12]], [[0, 1], [1, 2]], [0], [[1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10], [10, 11], [11, 12], [12, 13]], [[1, 2], [2, 3], [3, 4], [4, 5], [5, 6]], [[1, 2]], [[0, 1]], [[0, 1]], [[0, 1]], [[0, 1]], [[0, 1], [0, 2], [2, 3]]]}