{"ids": ["pLxzXmrH", "GDOUfLUG", "dnf24Slg", "qeH6KqeY", "j9OSru3Z", "H8gUtCNQ", "WKbnJSss", "r2kgIZGj", "8br9wTGT", "lsSt4I4n", "pskre6R4", "9BOCjAEj", "24YpOy8u", "0MrnCCRk", "ZsQeUSIE", "gIirU3Ua", "plD2I51j", "hy3UOoWd"], "dialog": [["hi all", "Is there a way to set folder ownership on mounted volume? Somehow, when I change permissions once, it’s kept on my local docker but not on AWS.", "ShurikAg: I have a really similar file permission issue. So upvote for any helpful tipp on this :)", "I'd suggest checking this out, since running as root is definitely an anti-pattern that should be avoided, [<-LINK->]"], ["I think, I have something important to say.It's the second time that this happens with me. I install docker on Linux Mint and after some hours the disk is full. Dont know why this happens, but I found out one thing, that also happens these two times. I lost all my system backups (I use timeshift). I dont know if it's some kind of conflit, but I think I have to report this, because it's a shame. The last time I had to reinstall my system, because I couldnt even start the system. This time, when I realise I had just 6GB left, I deleted some stuff here to have at least 20GB free, then disconnect from internet, restart, delete all docker images (Yes, I installed yesterday and I downloaded 4 images) then uninstall docker, and the magic happens. 100GB free right now ... Someone tells me. How this is even possibel that docker uses 100GB ? I was watching the free space decreasing. C'mon. Fix that. Until there, I will be using docker on a virtual machine, because I cant trust this software anymore.", "\"Fix that.\" great feedback", "@obernardovieira it sounds like you performed a \"docker pull somehugerepository\" instead of a \"docker pull somehugerepository:specifictag\" and ended up filling your disk", "@dragon788 doenst make any sense, because after I restart my computer, the disk free space keeps decreasing", "if you look at the disk space being used, what directory is the most full? you can use the Disk Usage Analyzer tool if that is installed"], ["I getError:[<-CODE->]. but an exec id is not an image, container or task. so docker inspect, as far as I can tell, does not support quering exec ids", "mikewrighton: I think you are correct, inspect is mostly for containers and images"], ["Hm, I'm having an odd issue. I'm trying to set up a php <-> nginx environment. I have them in separate containers, with a link from the nginx container to the php one called \"php\" in the nginx config I have a fastcgi_pass to \"php:9000\", which fails with a bad gateway \"connection refused\". if I ping \"php\" from inside the nginx container it tells me it\\'s pinging the ip 103.224.182.212. but the ip of the php container is 10.42.187.89. if I replace \"php\" with 10.42.187.89 in the nginx config for the F_pass it works. why is the link pointing to the wrong ip? D: it's not the host ip", "@Forecaster - are you doing the linking at runtime via docker run --link ? ", "might be worth posting your full command and any Dockerfile/docker-composer.yml etc.", "I just ran docker-composer up on this: [<-CODE->] and it links through OK (assuming you set up the nginx/php confs OK) - but the php:9000 part appears to be working. [<-CODE->] ", "@Forecaster - also, I think --link is deprecated? [<-LINK->]"], ["hello. i use rancher and using caddyserver as container and cant forward to my wordpress container, i tried to ping the wordpress container and i gives answer, but still cant proxy to my wordpress.. you could help me figure out my problem?", "hmm", "no one can help me out?", "hi@renegoretzka you might need to ping the Rancher channel as I'm not that familiar with how that platform interacts with containers and forwarding", "at first blush I\\'d check and make sure the containers are on the same network \"segment\" and then that you exposed the appropriate ports from the wordpress container", "gitter dont have a rancher channel", "i linked both, wordpress and caddy server.. and i even can ping them.. thats the weird path", "you can rundocker exec <wordpress id> ping <caddyIP>@renegoretzka?", "yea@dragon788", "I don't know if the container could have telnet, but you could try runningtelnet <caddyIP> portinstead of  ping, does that work?", "hmm, telnet does not exist", "dragon788: it seems like caddyserver does not get any request from outside", "since caddyserver didnt write anything to log", "what can be the reason?", "if it doesn't have a port exposed or if the service isn't running properly inside that could be an issue"], ["is anyone having trouble starting docker on the latest Mint? i think it's a systemd issue"], ["Hello, I have an issue with swarm. I have a simple java application which tries to call another application. I use swarm for my deployment through a network overlay. The problem is that when I scale an app, I can validate that the hosts behind the VIP are updated but my client keeps calling the same addresses.I tried a lot of things like changing java DNS cache ttlAnyone ever had something like that ?"], ["Im trying to replace my brew docker instance with a dockerized version - i can start the container - and see my data from within the container - but when i try and access it on the exposed port on os x - i get connection refused. [<-CODE->]"], ["I've got an interesting issue... I'm running docker containers and the application is reporting significant time skew. but when I check on both the host and the container using date and hwclock they are both identical and correct"], ["hi, ", "my docker on win10 has wired problem...someone know what is it? i use start.sh and it auto genrate new veth pair network. in control pannel. is that a issue or what can i do to fix it? i restart my pc and i can get an veth pair, but it generate many veth pairs settings in the control pannel. is that correct ? (default) Creating a new host-only adapter produced an error: [<-CODE->] "], ["Hi, ", "I am trying to run docker with the elasticsearch image: elasticsearch:5.1. But I am getting this error: [<-CODE->] How to fix??", "looks like the wrong java version?", "I found what was the error... there is a bug on linux using the version 5.1.2 of elasticsearch, fixed on 5.4. ops, 5.3. This is the issue: [<-ISSUE->]", "Thanks for sharing!"], ["I have a weird problem, services inside of the same network can't communicate, I see the following error: could not translate host name \"dev_db\" to address: Temporary failure in name resolution. but they are both in the same network as I can see in the inspect Network overlay:  [<-LINK->]", "So I just debugged the problem I have in my docker swarm. My swarm consists of a manager node and a worker node. I created my first service inside of my overlay network (called mynetwork) and constrained on the manager node. Then, I created another service that all it does is to ping the service in the manager node, so I constrained it in the worker node and also joined to the overlay network. The problem I have is the following, when I ping the service in the manager node from the worker node I get the following: helloworld.1.r5i6truptf61@swarm02 | ping: bad address 'dev_db' and when I ping the service from the manager node (so the same node as the service I'm trying to ping I don't get any errors) helloworld.1.bcay6ht12bs8@swarm02 | 64 bytes from 10.0.0.4: seq=0 ttl=64 time=0.027 ms", "I thought at first it could be the firewall the problem so what I did is to flush iptables in both hosts, but still nothing. nevermind, I just restarted the service in both hosts and now it works. I think there's a bug with docker overlay network"], ["Can anyone tell me how to map a local folder into docker in the latest version? I used to do something [<-CODE->], and while that option allows persistent changes between container launches, it doesn't map to the folder like it did in the previous version.", "[<-ISSUE->] I've come to believe it's a bug, so I've registered it as an issue.", "@lostllama you need share C drives to virtual machine", "It was already shared. The fact is, the same command that works with 17.06.1 doesn't work with 17.06.2. The drive shows up in the settings as \"shared\" in both cases. Unless the update to 17.06.2 somehow broke that sharing but didn't reflect it in the UI.", "oh,You can ssh to virtual machine then check C drives is mount to Linux", "What virtual machine? I'm running docker on my Windows machine. I'm fairly certain that it's a bug in Docker.", "Docker run in Hyper-v Linux virtual machine on windows 10 [<-LINK->]", "OK, but regardless of that, running the command to map a folder doesn't work on 17.06.2, but uninstalling that and reinstalling 17.06.1 and running the same command worked flawlessly, as it had been before I installed the update for 17.06.2 today. ", "Does that not strongly suggest that it's a bug with Docker?", "I don't konw is bug, I generally work with Linux", "I've never needed to configure anything regarding hyper-v, etc. other than granting Docker access to enable it. So I'm not sure how that stuff works. I think I'll just keep using 17.06.1 until they fix it.", "Thanks anyway.", "mybe,You can create issue on github", "The issue I linked above is the issue I created on github :-)", "well good"], ["Hello, ", "I have faced strange (for me) result of the command 'docker service update --rollback servicename'. The strange thing is that when I use docker scale command, it is assumed as an workers image update when when I want to rollback it just scales the service in the swarm down. Should I report this as a bug?", "Sounds like it works as expected. It rolls back to previous specification which is another number of scaling. ", "But feel free to open a issue on GitHub if you want to change the behavior"], ["is it possible to “import” a docker-compose file into another? I mean, I have multiple projects inside a same solution (a .Net Core application) and each project has its own docker-compose file… I want to have a solution level docker-compose file which describe all that services relationship… is it possible?", "@galvesribeiro there is a import statement in version 2.1(?) I know it is there and not working in version 3 xD", "hahahaah", "I’m playing with v3, too much text files and command lines for us Windows users :P", "In this case sry :/", "so the import isnt working on v3, it is a bug, and will be fixed, right?", "I mean, it is something that will be fixed and not something that was deprecated, correct?"], ["I'm using docker 1.10.1 and expecting to find a content-based hash in metadata in my local repo that I can compare with others' hashes of the same image to ensure we're using the same version. It looks like image ids (as reported by docker inspect --format='{{.Id}}') are not stable between systems. Are the digests supposed to be consistent between systems? (Unfortunately, it seems a bug even in the latest docker client version prevents making use of them: [<-ISSUE->]"], ["Hi guys!", "Does anyone know, why I can't see logs when building the image? I use docker on MacOS [<-CODE->].", "@sanyco92 On the latest \"stable\" version of docker for windows I know they have a similar bug. [<-ISSUE->]. Could be related? It may be worth downgrading, especially if it worked prior."], ["I have a question with named volumes. When create one with local-persist driver and map it to some directory in user home, app/ for example. app/ has permissions 775 and 1000:1000. Then i've run new container with nginx:latest with this new volume as /usr/share/nginx/html. Container change permissions of app/ to 755 0:0 (e.g. root)", "I've change permissions to 775 1000:1000 again recursively. Copy my files inside. All good and works. But when i re-create container (change nginx config for example) with docker stop-rm-run, permissions to app/ (only for app/ ) 755 0:0 again. If i simply re-run container with docker stop-start, all fine.", "With shared folders never see the same :(", "do you also recreate the volume?", "@SISheogorath no, volume was untouched", "Mhm do you have a link to the sources of your volume driver?", "@SISheogorath i don't use compose, if you asked about it. I've open issue at docker-nginx on github. But not sure that is nginx image bug", "Well, when you use the alpine image for example? does it appear there too? docker run --rm -it -v myvolume:/app alpine /bin/sh", "No, with alpine image app/ mounted correctly, 775 1000:1000. Looks like nginx during install chown and chmod /usr/share/nginx/src (app/ on host)", "that's possible, do you use the official nginx:latest image or an unofficial one?", "@SISheogorath official. This is workaround for described situation [<-CODE->]"]], "user": [["ShurikAg", "ShurikAg", "lucasjahn", "dragon788"], ["obernardovieira", "Forecaster", "dragon788", "obernardovieira", "dragon788"], ["mikewrighton", "dragon788"], ["Forecaster", "GastroGeek", "GastroGeek", "GastroGeek", "GastroGeek"], ["renegoretzka", "renegoretzka", "renegoretzka", "dragon788", "dragon788", "renegoretzka", "renegoretzka", "dragon788", "renegoretzka", "dragon788", "renegoretzka", "renegoretzka", "renegoretzka", "renegoretzka", "dragon788"], ["matrixbot"], ["ImFlog"], ["rightisleft"], ["holmser"], ["gofighting123", "gofighting123"], ["andrecavallari", "andrecavallari", "replicadse", "andrecavallari", "manueldeveloper"], ["smashingx1", "smashingx1", "smashingx1"], ["lostllama", "lostllama", "huangyanxiong01", "lostllama", "huangyanxiong01", "lostllama", "huangyanxiong01", "lostllama", "lostllama", "huangyanxiong01", "lostllama", "lostllama", "huangyanxiong01", "lostllama", "huangyanxiong01"], ["ctmnz", "ctmnz", "SISheogorath", "SISheogorath"], ["galvesribeiro", "SISheogorath", "galvesribeiro", "galvesribeiro", "SISheogorath", "galvesribeiro", "galvesribeiro"], ["michaeldye"], ["sanyco92", "sanyco92", "Warfront1"], ["thedrint", "thedrint", "thedrint", "SISheogorath", "thedrint", "SISheogorath", "thedrint", "SISheogorath", "thedrint", "SISheogorath", "thedrint"]], "dialog_label": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], "sen_label": [["GG", "OQ", "QA", "SA"], ["OQ", "AE", "AE", "NF", "SA"], ["OQ", "QA"], ["OQ", "QE", "RA", "AE", "AE"], ["OQ", "JK", "QE", "SA", "AE", "NF", "AE", "QE", "QA", "QE", "QA", "AE", "AE", "QE", "QA"], ["OQ"], ["OQ"], ["OQ"], ["OQ"], ["GG", "OQ"], ["GG", "OQ", "QE", "QA", "GG"], ["OQ", "OQ", "AE"], ["OQ", "AE", "SA", "NF", "SA", "NF", "AE", "AE", "QE", "QA", "AE", "GG", "RA", "UF", "GG"], ["GG", "OQ", "QA", "RA"], ["OQ", "QA", "JK", "AE", "AE", "QE", "QE"], ["OQ"], ["GG", "OQ", "AE"], ["OQ", "AE", "AE", "QE", "QA", "QE", "QA", "QE", "QA", "QE", "QA"]], "graph_edge": [[[0, 1], [1, 2], [1, 3]], [[0, 1], [1, 2], [0, 3], [3, 4]], [[0, 1]], [[0, 1], [1, 2], [2, 3], [3, 4]], [[0, 1], [1, 2], [0, 3], [0, 4], [3, 5], [4, 6], [6, 7], [7, 8], [6, 9], [9, 10], [9, 11], [11, 12], [12, 13], [13, 14]], [0], [0], [0], [0], [[0, 1]], [[1, 2], [1, 3], [3, 4]], [[0, 1], [1, 2]], [[0, 1], [0, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [6, 8], [8, 9], [9, 10], [9, 11], [11, 12], [12, 13], [13, 14]], [[1, 2], [1, 3]], [[0, 1], [1, 2], [1, 3], [3, 4], [4, 5], [5, 6]], [0], [[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10]]]}