{"ids": ["7JViIhRL", "p2PPdzDs", "DU2ptUKx", "8f2EdJij", "UqPRkwTT", "bBhViRFM", "Wg35yDCS", "FMNmMbYn", "erh7DD62", "nf4l1Z6b", "sfEMtQNH", "hryzzMtP", "1ZHyQsUX", "vl1ujahC", "piLlzqtY"], "dialog": [["Does anyone use Gitter in more than tab with Firefox?", "grahamperrin: What is happening?", "MadLittleMods:  [<-LINK->] mismatches between URL and content. Risks arising include: chat that's intended to be private, inadvertently posted to a public room (it happened to me a day or so ago).", "grahamperrin: Either [<-ISSUE->] or [<-ISSUE->] ", "More than [<-ISSUE->] ; the symptoms persist long after state is restored. Refresh, refresh, refresh and so on and the mismatch persists.", "grahamperrin: So [<-LINK->] extension issue?", "No, there's safe mode above in [<-LINK->] and in the screen recording that's mentioned there.", "effects can include apparent search failures e.g. as shown at [<-ISSUE->]", "grahamperrin: Definitely want to to tackle [<-ISSUE->] to see how that changes things", "Re: investigation [<-LINK->] if Firefox behaviour is proper (andglancingat the shot of Google Chrome in [<-ISSUE->] , Iassumethat itisproper), then maybe someone will have the rather thankless task of tooth-combing for areas where caching should/must be disallowed.", "… and on that potentially depressing note (sorry!) I'll say goodnight ~~~~", "^ hint: that example of anapparent search failure is in fact, on very close inspection, a mismatch between the URL/Lobbyand the room/lumina… both the title bar and the tab are strong indications that the writer is in one room when in fact, the writing is elsewhere.", "… and when in the Lobby at an?at=URL, both the title bar and the tab are diminished to a generic 'Gitter'; a more distinctive title e.g. 'TrueOS lobby' would be appropriate."], ["[<-LINK->] Mixture of public and private content. Ew.", "grahamperrin: on [<-LINK->] do you have chat-cache enabled?", "[<-LINK->] ", "Yep Mike. I do. Until today I never had a private conversation apparently mixed with public content.", "yeah, i've seen that happen before with chat-cache which is why it's not ready for prime-time", "i'd turn it off", "AFAIR this incident occurred after Firefox automatically restored tabs.", "also, what time zone are you in? ", "trying to establish when that 'engradeelnayyar' pinged you as i've warned him not to DM people"], ["Hi - is there a way to change the logo image for a community?", "davidleeuk: click on the big version of it in the header when you are in a room in that community", "mydigitalself: tried that... nothing happens :'(", "are you an admin of the community?", "Yep - I set it up", "davidleeuk: recently? what's the url of the community?", "[<-LINK->] ", "and when you're in [<-LINK->] and you click on the logo at the top, nothing happens? (not on the home page)", "That's correct - I can see the link cursor but nothing happens On chrome and IE"], ["almost daily running firefox if i leave gitter running I get an error that a script is not running correctly. Then I have to stop it and restart gitter. The script is [<-LINK->]. is this a known bug? [<-LINK->] image to followup on the above question", "lydatech: never got that error for me on firefox 51.0b6 win 10 64bit. Then again, I don't usually run for over a day. ", "lydatech: Pressing debug script and finding more details about the error might help?"], ["[<-LINK->] remains cold and empty after ten or more consecutive reloads.yep I'm having problem as [<-ISSUE->] i.e. network issues, it seems specific to that room. I'm on chrome; not using gitter.next"], ["My Github repo moved to a new owner. But Gitter is still pointing to issues and what not at the old URL. Is there a way to update this without having to create a new Gitter from scratch?", "selfagency: @MadLittleMods may be able to help", "selfagency: Send a message to support@gitter.im with the URL of the old and new GitHub repo along with the URL of the Gitter room. Make sure the new owner already has a community on Gitter we can move it to", "MadLittleMods: done"], ["hey there campers..... i think there is a bug blocking my progress. I am stuck on the 'Create a Set of Radio Buttons' where I've worte the following code:[<-CODE->] Please help."], ["@mydigitalself looks like there is a slight bug that popped up this weekend with peoples status orb not representing their current state. it is only updated after leaving the room and coming back. the visual bug is that peoples orb becomes “green” and it never goes to yellow when they are inactive", "so they get stuck as green? ^^ @samccone", "that is correct", "reproducible every time or just occasionally happens?", "i have not made it happen today yet...just something that I have been seeing over the past week or so", "well it's one of two things. either us being bad, or… we listen to blur() event and perhaps it's not being fired. we've seen it not being fired in the past occasionally when devtools are open...", "word, the fact that you just changed to yellow means it is not happening right now. ill let you know if I see it again just wanted to you fill you in", "ta mate. if you do see it happening again, can you ask the, er, victim if they are on chrome and they have devtools open and if it's docked or not pls?", "kk"], ["how to run gitter app on linux? I constantly get error of not being able to run. I submitted a bug report as issue in gitlab but that merge request 215 is making gitter on windows have some bugs. I run desktop app for a long time but I can't run it on arch for already a half month", "[<-LINK->]", "thx @MadLittleMods Well I did checkout \"h-michael/desktop-update-nw-0.41.2\" and npm install and added oauth.json credentials but when I run it I only get nw app not a gitter app.", "I also get the error [<-CODE->]", "@MarkoShiva Can you run the app from the master branch? ", "That error kinda sounds like package.json or oauth.json has a random character in it (check that it's valid JSON) Or it's just Chromium version mismatch complaining about some change in the extensions (all internal NW.js stuff)", "@MarkoShiva From [<-ISSUE->], it sounds like you need to make sure npm is installing the SDK version of NW.js which should be specified and install but something may be going wonky", "@MadLittleMods the icon starts but I can't access the app I only have the icon which when right click there is only Exit Gitter option. same error in terminal", "What to change to install SDK verson of NW.js not sure as I'm new to npm stuff. Btw I also removed config files from earlier installation on my system.[<-CODE->]", "previously run the npm install and created oauth.json according to instructions generated oauth on github and replaced stuff that should be replaced. like os Linux and clientid and secretkey. Btw I run archlinux is there something that need to be installed for development version to actually run or all can be installed via npm"], ["hi, ", "just popping into make a couple feature. recommendations and to ask about a potential bug: it'd be great for there to be a way to upload an image when you're in fullscreen mode on mac. right now, you have to exit fullscreen mode to drag-and-drop. there should be a photo icon or something above the markdown symbol on the right of the text entry that opens a file selection dialog. also: it'd be great if images opened in a lightbox instead of in a browser. why direct the user out of the app to look at content shared within the app? you don't do it for issues. as for my bug question: for some reason my github integration shows every notification twice. is there a way to fix that myself or is that an issue with the integration on gitter's end?", "@selfagency Take a look in your integration settings for that room (accessible via the room settings dropdown in the top-right)", "@MadLittleMods it only lists one integration", "@selfagency hmmm, do you see multiple webhooks setup on the repo on GitHub? ", "@selfagency File upload is only possible via drag and drop atm but adding some better controls is on our list. Mind filing an issue specifically for it though? [<-LINK->]", "@MadLittleMods yes i see three webhooks and they all say last delivery was unsuccessful. i have gitter under services as well"], ["Hi ", "I found a bug in the IRC gateway that prevents Smuxi from working with gitter. Where should I report that issue? I analyzed already what is wrong in the IRC message, it is a protocol implementation bug", "Im not sure if its live yet, but @malditogeek has just finished rewriting the open source irc bridge here"], ["Hi. ", "I just found out, that if I made an integration with Gitlab repo, mentioning and issue number with # actually is redirecting me to github instead of gitlab. I cannot find any setting that could fix that. Is there anything like it or it is a known bug (if yes, anyone knows the issue that is tracking this bug)?", "@Andrzej2_gitlab You can track [<-ISSUE->]", "@MadLittleMods wow...this is a 3 years old issue...so I guess it is going to take a long time. Damn. Thanks anyway.", "@Andrzej2_gitlab \"GitLab based communities/rooms\" are next on our roadmap so the wait is not going to be too long. Mind you the dates are slipping a bit since we temporarily shifted our focus on stability (security and bugs).", "@viktoma Ok, great. Thanks for quick anwsers. Will be waiting impatiently."], ["Bug Again. I don't see any network errors. No red colors  anywhere. All i see is this [<-LINK->] and the above error  [<-LINK->]. btw, that error doesn't happen everytime i switch rooms.", "that is happened to me. often time, then i have to refresh, so it got back to normal.", "@abhisekp Can you also show the network requests when it happens, copy all as HAR? The shorter the log that still reproduces, the better. Also enable timestamps in your console so we can match it up easier. None of us have reproduced this yet", "k. i will copy everything as HAR when it occurs again but can't guarantee on shorter log :P. enabled timestamps. thanks : "], ["since a few days ago, every new message that comes in is never marked as read until I refresh the page (and even then it sometimes doesn't mark it as read). is this the right place to discuss something like that? or should I just open an issue :/", "@AdamBurgess how are you accessing Gitter when this happens?", "@mydigitalself chrome 50, windows 10, so just through the browser. as you might be able to see it says I haven't read your message and now it says I have, but it's still green [<-LINK->]", "can you open up the console and see if you are getting any errors? wondering if somehow the javascript to mark the message as read isn't executing for some reason", "and see even for that message it's turned up as if I wrote it: [<-LINK->]. no errors in the console, just mixed content warnings from embedding images from imgur", "ah wait a minute. chrome 50 - canary?", "yes, -dev", "ahh.... we've seen loads of issues with this version. do you have regular chrome too?", "not canary, dev. canary installs separately but chrome/beta/dev can't be sideloaded afaik, so no, at the moment I don't have a normal install", "i can run both side by side on my mac pretty easily (by not doing anything, just installing). anyway... we're looking into issues with this version at the moment. not sure if there's a valid bug in chrome or if it's uncovered a bug our side that's not happening on other browsers"], ["Hey! ", "Not sure if it's a bug, but /collapse doesn't collapse all the media embedded, it only closed the last media on the thread. If it's not a bug, it'll be cool to also have a \"visual\" button for it, because when there is a bunch of media loaded, the page get's a bit laggy. ( ... And if the collapse command doesn't allow to close them all.. It takes some time to do it manually :s )"]], "user": [["grahamperrin", "MadLittleMods", "grahamperrin", "MadLittleMods", "grahamperrin", "MadLittleMods", "grahamperrin", "grahamperrin", "MadLittleMods", "grahamperrin", "grahamperrin", "grahamperrin", "grahamperrin"], ["grahamperrin", "mydigitalself", "grahamperrin", "grahamperrin", "mydigitalself", "mydigitalself", "grahamperrin", "mydigitalself", "mydigitalself"], ["davidleeuk", "mydigitalself", "davidleeuk", "mydigitalself", "davidleeuk", "mydigitalself", "davidleeuk", "mydigitalself", "davidleeuk"], ["lydatech", "geekyi", "geekyi"], ["geekyi"], ["selfagency", "mydigitalself", "MadLittleMods", "selfagency"], ["srimanipandey"], ["samccone", "mydigitalself", "samccone", "mydigitalself", "samccone", "mydigitalself", "samccone", "mydigitalself", "samccone"], ["MarkoShiva", "MadLittleMods", "MarkoShiva", "MarkoShiva", "MadLittleMods", "MadLittleMods", "MadLittleMods", "MarkoShiva", "MarkoShiva", "MarkoShiva"], ["selfagency", "selfagency", "MadLittleMods", "selfagency", "MadLittleMods", "MadLittleMods", "selfagency"], ["meebey", "meebey", "trevorah"], ["Andrzej2_gitlab", "Andrzej2_gitlab", "MadLittleMods", "Andrzej2_gitlab", "viktomas", "Andrzej2_gitlab"], ["abhisekp", "texas2010", "MadLittleMods", "abhisekp"], ["adamburgess", "mydigitalself", "adamburgess", "mydigitalself", "adamburgess", "mydigitalself", "adamburgess", "mydigitalself", "adamburgess", "mydigitalself"], ["LukyVj", "LukyVj"]], "dialog_label": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], "sen_label": [["OQ", "QE", "QA", "SA", "NF", "QE", "QA", "AE", "AE", "AE", "AE", "AE", "AE"], ["OQ", "QE", "AE", "QA", "AE", "AE", "AE", "QE", "SA"], ["OQ", "SA", "NF", "QE", "QA", "QE", "QA", "QE", "QA"], ["OQ", "QA", "SA"], ["OQ"], ["OQ", "QA", "SA", "UF"], ["OQ"], ["OQ", "QE", "QA", "QE", "QA", "AE", "AE", "QE", "PF"], ["OQ", "SA", "NF", "AE", "QE", "AE", "SA", "QA", "UF", "AE"], ["GG", "OQ", "SA", "UF", "QE", "RA", "QA"], ["GG", "OQ", "QA"], ["GG", "OQ", "SA", "UF", "SA", "PF"], ["OQ", "QA", "QE", "PF"], ["OQ", "QE", "QA", "QE", "QA", "QE", "QA", "QE", "QA", "AE"], ["GG", "OQ"]], "graph_edge": [[[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10], [10, 11], [11, 12]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [6, 8]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8]], [[0, 1], [0, 2]], [0], [[0, 1], [0, 2], [2, 3]], [0], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [4, 7], [6, 8], [8, 9]], [[1, 2], [2, 3], [3, 4], [3, 5], [4, 6]], [[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5]], [[0, 1], [1, 2], [2, 3]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9]], [[0, 1]]]}