{"ids": ["8UqNQkah", "YdtSdLny", "QGcburCj", "bXbPSIfm", "28bGTWfl", "bUblXIzK", "JHJz9dQe", "qJeKwoJ2", "JPc3IzTJ", "34UOhcZc", "J6G3NRld", "h79ebhf0", "4rYlDKtZ", "Nivtc87c", "Q0Q7gCQg", "jXt9Ub78", "AML7TW7y", "uRKpAChC", "kwTOo8He", "gglF8UrC", "ytrsHWd6", "U9EaLtat", "31vKMiNl", "ZjsMCOVt", "olIghJyY", "KBrooLN3", "N4QioLXG", "3R4qoZrB", "DVfTCQt8", "637tYcaE", "JJOOpqYt", "DpKxR0xI", "HcwALb04", "YrNKCe3T", "OCmbcoFF", "70qpkswS", "EsSsbRig", "Sl06wj1X", "C0c9F8Bh", "soGkdYeX", "BdsxNL7L", "fyGijbvB", "XLokDSi5", "nPaYjm9E", "FnjhuVCp", "4aEnUFCC", "TkmjF594", "EPzBozel", "7T0xvdDv", "HS0al3xO", "S8DnXAoD", "RBNS6f3a", "C18AjsoF", "OG21kNKh", "0rUIqFQj", "Nneggh0n", "8ldIpfpi", "vFvsELCF", "dtZyt2Mb", "EZ4IY5MX", "pbOa52Eh", "aYGwCzAy", "juyhA8qh", "ijT6ZUNd", "c9ERvJUj", "v4h41Vbl", "rkTrTeQF", "kqCVoQ04", "8lW8MIsd", "yB9t3G83", "4QLekFEL", "HbqvFKBi"], "dialog": [["How would I run the program C++? (the simplest way) There are so many programs for one language. If someone can pm me to help me step by step itd be greatly appreciated"], ["it appears that non-favorites in the All Conversations list aren't maintaining their sort if you \"refresh\" the webpage or close and reopen", "dragon788: non-favourites don't maintain a manual drag and drop sort. You can sort them kinda but not supported", "ahhh, ok. guess I'll have to make my favorites list huge then :)"], ["Anyone, please: how does  toggling relate toNext? I have the bookmarklet to toggle but when Next is enabled I can't see [<-LINK->] . More generally, when I toggle off (away from Next), I don't see any change in the GUI but the appearanceisconsiderably different from what I recall of things a few weeks ago. toggles on again … there's the green NEXT indicator but apart from that indicator, I can't see the difference between off and on.", "At the moment there's no difference between the two. If an issue is closed, its generally in full production.", "OK @mydigitalself ", "with [<-ISSUE->] as an example, I see no scroll bar for search results. Do you?", "Donot, on mobile and my laptop battery is dead and left my charger at the office", "If you don't see it, comment on the issue with details on your platform, could be os/browser specific.", "Firefox 49.0 (loaded with extensions) on TrueOS Desktop, which tracks FreeBSD-CURRENT. I'll start the browser in safe mode and review. Back in five.", "Yeah... that's not an environment we test on, so wouldn't be surprised if it was platform specific bug.", "OK, now there's a (terribly faint) scroll bar. Maybe an extension conflict :(", "Still in safe mode, the bar appears only if the left menu is toggled to 'make the space for results persistent before a search is performed.", "And if search results are not cleared before that toggle, then (still) there's no scroll bar.", "grahamperrin: clears search results", "Still no scroll bar for search results. Weird.", "Now with Chromium, and just one extension (LastPass). Still no scroll bar.", "Now back to normal mode for Firefox, loaded with extensions.", "The problem persists and (fingers crossed) I have a workaround that's good in both Chromium and Firefox:zoom in [<-CODE->]"], ["hi", "The one missing feature of Gitter I would like to see is the ability to search through room history. I see this: [<-ISSUE->]. I wonder how long it might be before we see this feature implemented? other than that I prefer gitter over slack", "zacts: you can search the current room, not across rooms. use the search icon to the left.", "mydigitalself: Nice, thanks! re: searching chat room history"], ["discourse has slack chat plugin ... is there nay plans for gitter plugin for same?"], ["Mikaela: wishes the reactions came to GitHub mobile web and API too so it didn't need remembering what to on desktop and it could be clicked in Octodroid which is also missing subscribing thanks to API not having it", "Mikaela: it's available in preview via the API", "[<-LINK->] look below the payload", "I mean subscribe to email notifications", "wishes the reactions came to GitHub mobile web and API too you said exactly that", "and then went on to say more about subscriptions in the API", "and i'm saying that reactions is coming to the API and you can preview it", "Sorry, I confused.  That could probably be thrown to octodroid tracker"], ["Hey there everyone ... is there any group on gitter that discus about c or c++?", "divyanshdubey: please do not create new communities and randomly add people you don't know into them. ", "you are welcome to share a link ingitterHQ/developers to your new community. But what you just did is not cool."], ["Hello. ", "How do you scroll up or down in a room?", "leni1: Mouse wheel or the scroll bar on the right of the chat", "TheDiamondYT1: using a touchpad :P", "No keyboard shortctuts?", "Like using the up or down arrows or something?", "Pg Up and Pg Down work", "Yes... That's what I was looking for. Thank you", "TheDiamondYT1: thanks", "Anyway, why not use this its possible on a touchpad"], ["I see a box in Windows 7 Starter 32b SP1", "That's the glorious XboX", "ah! :D", "Please talk to Micro$oft about that@abhisekp", "abhisekp: that is likely a UTF/unicode character that your current browser/font selection doesn't understand", "iirc Windows Starter didn't have all the language packs available that Home/Pro/Enterprise did", "hmm... ok.. thanks@dragon788 ", ":D"], ["if i delete my message on gitter does it stay on other people's threads?", "no", "thanks", "raniesantos: I think the only place the message will exist is if somebody was subscribed to instant notifications via email on a channel"], ["what’s required to make the markdown badges work? simply a link to one or more repos?  in my dreamworld, I’d have /Circlical (5813fc7bd73408ce4f31955f) and a bunch of MD badges in my repos that lead to it. but it seems the repo is associated to community, and not to room?", "Because you are trying to create a community for a repo on your personal user, your only option is to create a community based on theSaeven/zf3-circlical-userrepo and keep theLobbyroom.", "I’d easily move the repo to the org", "You can have a badge for any room. It's just that the share modal only shows the template for public rooms associated with a repo  [<-LINK->] ", "so, I should create rooms within Circlical/ and then handcraft the badges into the markdown", "and when the day comes, I delete those two other communities to soothe my OCD", "That would work", "alright, sorry to be so daft.  ", "I did look for documentation a priori! ;)"], ["(I was wondering if Matrix bridge. I [<-LINK->] was having some issue here as one line wasn't visible and also sorry for spam as my phone seems to be misbehaving at the moment, pasting is difficult)"], ["Where can I go to buy an encoder? [<-LINK->]", "Crljules: e-shop"], ["Hi I'm new to the community. It's nice to be here, I am just starting to work with Linux any advice would be greatly appreciated", "jermbone1000_twitter: check BSD systems "], ["hello", "I'm using gitter's irc gateway and from the irc client I don't see an user that's actually on channel and is talking with me. he is not in the nickname list, i tried disconnecting from irc.gitter.im and connecting again to no avail. the user is signed in using a twitter account, I haven't had any issue (that I noticed) with github-signed users. can anyone check this and confirm it's an issue of the irc service?", "I think from IRC you only see people connected from IRC in the nick list.", "pdurbin: AFAIK only top 32 people are shown in IRC", "abhisekp: why?", "idk... gitter devs would know the reason"], ["Hello everyone. I am new to gitter. ", "I created a new private chat room today. When I try to add someone It results in a \"Forbidden\" message. The user I am trying to add has already made the membership of the organization public and has already allowed private access for the organization. Can someone help me?", "@sriranganathan hmm, it sounds like you have taken the correct steps so far. The room is based on a private repo?", "You mentioned \"has already allowed private access for the organization\"(could be interpreted as the third party access org setting) but has the user granted private repo scope? [<-LINK->]", "MadLittleMods: Thank you for the prompt reply. I will ask him to check this "], ["MadLittleMods: hey... regarding the chat and transferring of messages. maybe thats good enough. Because i guess i can add/invite all the learners to the new channel easily. If in addition, the old channel is being deleted or forwards to the new one, thats fine. But i guess i still need to write tosupport@gitter.im?"], ["[<-LINK->] Almost invisible ... Are there something like DMCA's or name claims for communities?", "@Bluscream DMCA has no relevance for community names. DMCA is specifically for content violations where circumvention of rights management is being distributed such as PirateBay, KAT (closed as a result of a DMCA case & arrest), Popcorn Time etc...It criminalizes production and dissemination of technology, devices, or services intended to circumvent measures (commonly known as digital rights management or DRM) that control access to copyrighted works.if there's a name violation that's infringing on a trademark infringement a legal precedent would need to be established if the use is happening beyond Gitter. if the use is unique to Gitter, evidence of a registered trademark and infringement would need to be established.", "ah thanks ok. ", "I was afraid i can't claim my company's name", "you'd have to have an internationally recognised EU trademark", "okay, the error message seems pretty neat btw..", "like we don't even have twitter.com/gitter- tough luck for us", "The red mark doesn't tell me much :(", "you should normally see a tooltip", "[<-LINK->] <--- that's basically preventing you from using that URL", "oh it checks for taken github user/org names?", "can maybe try something like adquardHQ as your url"], ["Basic question !! How can i setup gitter so it ONLY gives me notifications for where i am mentioned ?? I want to set this globally for all my gitters", "joeblew99: go to notification settings,  in any room, click onConfigure Defaultschange it toMutedone.", "per what @mydigitalself said, you can also apply that as the default to all rooms after setting it for one, or at least there is a link there @joeblew99", "mydigitalself: thanks.  have done and that and see if its less chatty :)"], ["I am stuck . <p>   I have to Chang colour  to p element tex. Can anyone help please", "[<-LINK->] @craigchilled This room is for Gitter support, not general technical support. Please read the welcome message when joining a room and take note of the room description/topic in the chat header at the top. After fixing up your question, [<-LINK->] , you should try [<-LINK->] "], ["anyone give me wordpress slideR>?", "engradeelnayyar: This room is for Gitter support, not general technical support. Please read and adhere to the welcome message you see when joining rooms and the room description/topic at the top in the chat header. Google will be your best bet to compare options"], ["Hey would it ever be possible that IRC access could be allowed to not require signup (for non private rooms, perhaps as opt in?)", "like freenode?", "yes, exactly like freenode", "of course, I do also use freenode, but everyone loves gitter more than freenode. I especially like the public logging of channels Gitter does, which is something that freenode doesn't have or even encourage by default.", "me too - but for something I am working on gitter works better", "I wouldn't mind having some sort of bridge from Gitter to my freenode channel, which I already have public logging for. I would consider my logs to be canonical. I wouldn't care if Gitter logs the channel as well. It's more about having an easy way for people to jump into the channel and start talking.", "We tried same room.io which is close - but makes it come through one user, which is odd.", "Yeah, I haven't quite been satisfied with the user experience so far. For now, I just stook up an instance of Shout so people have an easy way to connect to the freenode channel from a web browser. No freenode captcha, no having to think about which channel to join. You just pick a username and start talking. Works pretty well.", "The user experience of the various \"sync freenode and Gitter\" solutions, I mean."], ["Hello everyone! Is there any kind of sandbox room for me to test gitter's Markdown? Also I don't really like Gitter's Unread indicator and at slash all mentions as it force me to read messages that are unrelated to me.", "[<-LINK->] found by clicking the globe icon at the head of the page", "khanh2003: are you using a web browser?", "grahamperrin: oh it is not really obvious to new users. showing list of rooms when going to gitter.im homepage is better [my-2-cents]", "Maybe caused by (i) browsing away from this room then simply (ii) back, without (iii) actively reloading the page. I'll test whether it's reproducible with Firefox with a new profile.", "grahamperrin: you are right.", "khanh2003: did you use Firefox in safe mode? Or with a new (clean) profile?", "grahamperrin: i tried. it is reproducible.I am the person who open issues but never Pull Request", "LOL. Reproducible in with Firefox in safe mode?"], ["Hello! Is there a ‘Manage Account’ interface by any chance? If not, is there functionality to ‘Sign Out’ of my Twitter-linked gitter account and use GitHub for authorization instead? Thanks! (Within the OS X app itself)", "arronio_twitter: on the OS X app, the menubar bar icon (next to your system clock, wifi settings etc…) has a signout option. you can then sign in with GitHub, this will effectively create a new account.", "mydigitalself: Oh dang, of course, I hid that! Thanks :)\""], ["How to make a room invite only afterwards?", "Bluscream: you can't change the room type after you've created it", "So i have to delete and recreate the whole room? :/", "That's not very user-friendly", "It's just not something that's implemented yet", "I can count on one hand the number of times it's been requested, and i don't have an abnormally large number of fingers ;)", "[<-LINK->] @Bluscream Create a new issue [<-LINK->] "], ["is gitter blocking to show site information?", "burning-monk: Can you ask that in another way? I don't quite understand what you are asking about", "normally in firefox there is the option at the left of the address bar to show page information", "burning-monk: We aren't blocking it. It works for me in Chrome and Firefox", "ok, then I guess it's an issue with my browser"], ["Hi people, I love Gitter, coming from Slack. But what's really annoying is that \"eyeballs\" indicator. It was much clearer and more reliable in Slack which used a connection indicator. This issue [<-ISSUE->] ( [<-ISSUE->] ) was opened like two years ago, any news on an improved indicator? Thanks :) I also experience the same as [<-ISSUE->]"], ["Hello world! Just joining now. Looking forward to learning a bunch from y'all!", "julisan1: Perhaps you meant to go to [<-LINK->] - Just curious, how did you end up in this room (retrace steps)?", "MadLittleMods: , I guess you're right.", "[<-CODE->] Still curious on how you got into this room after signing in if you can remember", "MadLittleMods: , I was trying out suggestions provided to me by freecodecamp", "julisan1: Can you expand or link what you mean by suggestions?", "@MadLittleMods @julisan1 I guess these suggestions?"], ["any one know how to make popup ?", "a", "engradeelnayyar: Perhaps you meant to go to [<-LINK->]"], ["Hi everyone", "what is the best way to share a list of rooms with my development team? i was looking for a way to share my profile with them... hoping it would show the list of rooms i joined or starred", "jbcebe-seekers: It has been mentioned internally before but there isn't a way to share a list outside of linking a community home [<-LINK->] ", "MadLittleMods: thanks Eric, how would you use the community home for that purpose?", "do you mean... just share the URL by some other mean outside Gitter?", "for example in GitHub or Twitter... you could see who I am following, which repo I starred", "I wished there was something similar... so I can show other ppl which chat room i'm in  :) or which one i starred"], ["Hi folks, I’m having trouble creating a community for one of my GitHub repos (mwpastore/sinja). It shows a red exclamation mark next to my repo name, but hovering over it doesn’t reveal any additional information. Hovering over “Next” shows a  tooltip icon; I can click on “Next” anyway but it takes me back to the initial create a new community screen with no further error messages. I’ve tried in Safari and in the Gitter app for macOS, and I’ve confirmed that my repo is not marked private and the name is not taken ( [<-LINK->] returns a 404 page). Any suggestions? It looks like maybe the name is too short", "mwpastore: It should show a tooltip with the error if you try to submit with next button or when focused in that input. It is probably a conflict with [<-LINK->] so you need to adjust the slug/URI", "a-ha, there’s a user named sinja", "yeah, it’s not showing any tooltips or errors or anything", "welp, that settles it. thanks@MadLittleMods!"], ["is there an easy way to reference another channel without the full gitter.im URL? or is that the best way?", "that's the only way", "ok, makes sense since # gives you tightly integrated GitHub issues/PRs so it wouldn't work for a channel name"], ["Hey", "How can I give admin permissions for a gitter organization to one more user ? I can see a \"Permissions\" option in every room's settings, but I want to give admin rights to this user organization-wide", "amberj: what do you see at the bottom left of that modal?", "\"Edit community permission\".. yup this is what I was looking for. Thanks@mydigitalself", "just add them as extra admins if the community is linked to a GitHub org"], ["Good afternoon. ", "Is there a way to Mark all messages (in a room) as read?", "Type \"/\" and look at the bottom :)", "Ah- so easy. Thanks :)"], ["Hello I'm new. But I have a question about Git.  Can I ask these type of questions here?", "Guaby: This room is for Gitter support. You can try [<-LINK->]"], ["our repo was converted from a personal repo to an organizational repo— how can we update our gitter to point to the new repo?"], ["Hello guys :D", "I need some help from any admin!. I had created this account : [<-LINK->] , which was associated with the github account severustux. But later I deleted the linked github account and opened the account  \"severus-tux\" and this is the one I am currently using ( [<-LINK->] ) . I would like to delete my old gitter account  ( [<-LINK->] ) but I cannot login to it as I have completely deleted the linked github account. Could someone help me ?"], ["i want to know how can download a website text?", "engradeelnayyar: with respect, that's not a Gitter support question. Please seek answers in a more appropriate area; you're likely to find the question asked, and answered, at [<-LINK->] "], ["Archives here [<-LINK->] and elsewhere no longer work.", "grahamperrin: archives working for me.. maybe fixed since you asked", "Heat map present but no heat, no presence of archived content", "Works for me, I can see the \"heat\", the green coloured blocks; can also browse archives. ", "No errors in console", "[<-CODE->]", "That was from reproduction of a cold and empty heat map with an almost new Firefox profile on FreeBSD-based TrueOS Desktop; nothing other than LastPass installed. Since then I have reproduced the problem with Firefox on Android for both [<-LINK->] and [<-LINK->]", "Now with TrueOS Desktop I see what's expected, maybe thanks to a Control-F5 reload without cached content).", "Android, now [<-LINK->] looks OK, maybe thanks to a reload"], ["Hey, I'm trying to add the github repository activity to the gitter autoNumeric channel, but as a collaborator (with write access to the official repo), I only see my own repo and forks. Why is that?", "AlexandreBonneau:  [<-LINK->] and I assume you want activity from [<-LINK->] - You would need to have admin permissions to add a webhook. Because it is a repo on another user, they might need to add it themselves because there isn't any third party application access like on an org.You could setup a custom webhook integration and give them the URL to add in the GitHub interface", "MadLittleMods: ok thank you"], ["does anyone know anything about performance testing?", "Performance of Gitter? If it's not a Gitter support question, please ask elsewhere. Thanks."], ["just my monthly moan that rooms should be open by default:Went to: [<-LINK->] Thought, I have an issue, wanna discuss it, so I change URL to: [<-LINK->] - 404.... now what?", "intellix: don't understand the issue - public is the default permission when creating a room", "the issue is 404 when renaming a github repository URL to gitter, because the owner hasn't opted into creating a room: [<-ISSUE->]"], ["I am having an issue where I either leave, or type /leave in a channel, and as soon as a message is posted to the channel it pops back up in my conversations list", "Maxels88: the web interface, yes? Do you use GitterNextand if so, is chat-cache enabled?", "grahamperrin: I think I figured it out. ", "I stumbled on some irc interface and had that hooked up. leaving the channels on my irc client seem to have stopped the auto rejoins", "thanks for the follow up though"], ["how do you trigger text correct s/word/repacewiththis ? I tried just typing that on the next comment but it didn't work s/work/workie [<-LINK->]", "note the trailing slash on the second word", "vim/sed syntax is s/badword/replaceword/(magic gitter doesn't have)", "appears to be could be straight up busted", "and you can only edit 1 message back, not within a whole block", "not busted, because 'appears to be' was \"also\" before :)", "this is a testicle", "nice it worked thank you", "damn it doesn't work in the IRC portal just in the browser gitter :/", "Yeah, in IRC you just receive the messages from gitter so you see the pre edit and edited texts", "And I think replies are pretty much immediate the same way", "you can only edit 1 message back. I have not noticed that restriction.", "grahamperrin: when using the s/word/fix/ syntax", "Otherwise it's a 5 minute window"], ["Is it a bug or a feature that it looks to people that I read at Gitter messages immediately because I use irc.gitter.im? This came to my attention at [<-LINK->]", "all*", "\"feature\" I think, as you also get to read people's messages instantly and when they make edits it sends a new message to your client rather than \"fixing\" the old one, so you can see everybody's dirty minds :D"], ["[<-LINK->] suggests four, not three, ` characters for blocks of code. Is that a typo?", "grahamperrin: yip - thanks. corrected.", "Thanks. I deleted my comment there."], ["Hi,  guys!  Please,  help me to know how i could add cufon in my project..  Maybe someone can share with me different tutorials or links to educational materials with this topic?", "Is the project Gitter-related?  If it's not a Gitter support question, please ask elsewhere. Thanks.", "There's a \"community\" link at [<-LINK->]"], ["Hell-O's"], ["can we have an option to upload images so that users can share screenshots", "arunkumar413: You can already paste or drag images into the chat.", "cbj4074: thanks. ", "paste does not have the required effect when the copy is from within e.g. Eye of MATE Image Viewer.", "I see now that it works when copied from e.g. GIMP.", "grahamperrin: Depends on how the OS and your browser interprets things. Not very standard", "grahamperrin: Sure, no prob... sounds like it can be finnicky!"], ["hello", "@ProProgrammer  can you notice any bug in the  html here [<-CODE->]", "indonogakusei: if not related to support for Gitter, please seek help elsewhere. This room is dedicated to Gitter. Thanks."], ["Is there a code collapse feature?", "lydatech: I think if you click the ... there is an option to collapse gifs and possibly code blocks", "dragon788: No not code", "shucks, collapsing code could be handy", "Agreed"], ["Hi, we renamed our github repository there is a chance to rename the gitter channel ?"], ["Hi there! ", "Is Gitter.com unstable? Or is it my laptop? Keeps crashing. It crashes often. Now it doesn't show my last line.  Anyone??", "we can hear you"], ["Good morning all. What are the limitations of integration deployment within rooms? Seemingly anyone can add integrations to any room but I haven't seen any events show up in any room where I'm a member, or otherwise. Oh and while I'm thinking about it, both the android and iOS apps will blank out the content of a room (right pane empty, right header still visible). In such cases the only way to recover is to switch to another room and switch back, sometimes more than once to get the content to reappear."], ["Hi can you merge this with my github account please", "MadLittleMods: Hi can you merge accounts", "weirdavid1_twitter: re: [<-LINK->] above please refrain from the personal address. Thanks.", "Cool just read it", "Quiet in here tonight"], ["hi my profile picture will not update"], ["hello world"], ["is gitter open source?", "Good question. I don't believe so."], ["hello", "how can i find settings in gitter? to delete account"], ["searching in gitter is a PITA, ...@RodMyers is the pain mostly with the disorder? (The lack of order to search results?)", "grahamperrin: just trying to find a thread can be tedious.  And when a number if us are conversing. The log file grows exponentially", "Thanks@RodMyers", "FYI [<-LINK->] and the two that most affect me are [<-ISSUE->] and above all, [<-ISSUE->]"], ["Hi all,Does anybody know how to break a line in Gitter mobile application (Android)?I tried Shift + Enter, Ctrl + Enter. But it doesn't work.", "DKurilo: @tommego@seanmitchThis room is for Gitter support. Please read the welcome message when joining a room and mind the room description/topic in the chat header. Please use [<-LINK->] ", "MadLittleMods: , I asked about Gitter. My question is:How to make new line in Gitter mobile application?", "[<-LINK->] @DKuriloYou can't, there is only chat mode on mobile.", "DKurilo: there is a workaround, if you type some text and move your cursor into the middle of the text and press the enter key it will give you a new line and not send a text, at least on Android. And only sometimes", "dragon788: , thanks. It's not very comfortable. :)"], ["howdy... just joined gitter today in order to work with the Plone community.  i got connected to the IRC bridge, and it works okay... however, my client is being queried (/who) once per minute, littering my logs with useless messages. Is that expected/normal?   Also, it would super nifty if that bridge could (optionally? bi-directionally?) convert '<nick>:' at the start of a line to '@<nick>', so as  to improve interoperability between the two conventions of addressing individuals in a room."], ["Hi everyone! ", "my \"ACTIVITY\" bar is not updating. my \"integrations\" are correctly configured... any suggestions? ", "thank you!"], ["Good morning", "is their a way to merge 3 glitter accounts this one and@dweiruk_twitterI believe it was"], ["Is [<-ISSUE->] going to be fixed at some point?I may be wrong, but it seems like an easy fix, and the issue has been open for over a month now."], ["Hi! Curious if there are any communities in particular that show a good example of room organization. Looking to set one up for my community and want to see a finished product", "lisbetho: some organizations use a \"Lobby\" room that is org specific, and then they have additional rooms for each repository, but you can also set up rooms around topics as well (see FreeCodeCamp for examples)"], ["It doesn't work on my site: [<-LINK->] Login issue"], ["Geezus43How do I bridge riot to gitter?"], ["I am new here. I really like this approach of an app directed at community-building. However I feel that the homepage does not do a great job of communicating this. Also, it took me a while to figure out how easy to go into a room and try it out.", "somebody at?", "paramaggarwal_twitter:"], ["To make a suggestion about chat functionality, should I post it [<-LINK->] or maybe some could point to a place where I could post a suggestion. GitHub issues maybe?", "OFFLlNE: Yep, feature requests go on GitHib issues. You can indicate that it's a feature request in the title, and the maintainers will tag it accordingly.", "cbj4074: aight, thanks"], ["hi, trying to use the android app login via Github, and it's stuck at Two-factor authentication, waiting to receive an SMS but nothing coming. Is this only usable on a phone (and not a tablet with no SIM) ?", "never mind, SMS arrived after a long wait!"], ["Hello everybody. ", "Not sure if it is a gitter bug but Gmail fails to classify some gitter notifications to Updates category, anyone has the same bug?", "why wouldn't you ignore all the notifications", "yeah, it is kind of low priority bug, but it is little annoying since Gmail will popup for a new mail but it won't if the notification is redirected to Updates category (which happens most of the time but not always)", "I disabled all gitter notification mails, instead I have irc highlights. [<-LINK->] try it", "yes, also I changed the notification settings to notify me by mail only if my username is mentionned, thanks"]], "user": [["Aaawesomealex"], ["dragon788", "MadLittleMods", "dragon788"], ["grahamperrin", "mydigitalself", "grahamperrin", "grahamperrin", "mydigitalself", "mydigitalself", "grahamperrin", "mydigitalself", "grahamperrin", "grahamperrin", "grahamperrin", "grahamperrin", "grahamperrin", "grahamperrin", "grahamperrin", "grahamperrin"], ["zacts", "zacts", "mydigitalself", "zacts"], ["ghost~5826a72ed73408ce4f354d4f"], ["Mikaela", "mydigitalself", "mydigitalself", "Mikaela", "mydigitalself", "mydigitalself", "mydigitalself", "Mikaela"], ["divyanshdubey", "mydigitalself", "mydigitalself"], ["leni1", "leni1", "TheDiamondYT1", "leni1", "leni1", "leni1", "TheDiamondYT1", "leni1", "leni1", "TheDiamondYT1"], ["abhisekp", "viluon", "abhisekp", "viluon", "dragon788", "dragon788", "abhisekp", "abhisekp"], ["raniesantos", "abhisekp", "raniesantos", "dragon788"], ["Saeven", "MadLittleMods", "Saeven", "MadLittleMods", "Saeven", "Saeven", "MadLittleMods", "Saeven", "Saeven"], ["Mikaela"], ["Crljules", "abhisekp"], ["jermbone1000_twitter", "ghost~5826a72ed73408ce4f354d4f"], ["anddam", "anddam", "pdurbin", "abhisekp", "anddam", "abhisekp"], ["sriranganathan", "sriranganathan", "MadLittleMods", "MadLittleMods", "sriranganathan"], ["serapath"], ["Bluscream", "mydigitalself", "Bluscream", "Bluscream", "mydigitalself", "Bluscream", "mydigitalself", "Bluscream", "mydigitalself", "mydigitalself", "Bluscream", "mydigitalself"], ["joeblew99", "mydigitalself", "dragon788", "joeblew99"], ["craigchilled", "MadLittleMods"], ["engradeelnayyar", "MadLittleMods"], ["michaelneale", "pdurbin", "michaelneale", "michaelneale", "michaelneale", "pdurbin", "michaelneale", "pdurbin", "pdurbin"], ["khanh2003", "grahamperrin", "grahamperrin", "khanh2003", "grahamperrin", "khanh2003", "grahamperrin", "khanh2003", "grahamperrin"], ["arronio_twitter", "mydigitalself", "arronio_twitter"], ["Bluscream", "mydigitalself", "Bluscream", "Bluscream", "mydigitalself", "mydigitalself", "MadLittleMods"], ["burning-monk", "MadLittleMods", "burning-monk", "MadLittleMods", "burning-monk"], ["ThomasPrioul"], ["julisan1", "MadLittleMods", "julisan1", "MadLittleMods", "julisan1", "MadLittleMods", "abhisekp"], ["engradeelnayyar", "engradeelnayyar", "dragon788"], ["jbcebe-seekers", "jbcebe-seekers", "MadLittleMods", "jbcebe-seekers", "jbcebe-seekers", "jbcebe-seekers", "jbcebe-seekers"], ["mwpastore", "MadLittleMods", "mwpastore", "mwpastore", "mwpastore"], ["dragon788", "mydigitalself", "dragon788"], ["amberj", "amberj", "mydigitalself", "amberj", "mydigitalself"], ["mapukhakis_twitter", "mapukhakis_twitter", "ricardobaeta", "mapukhakis_twitter"], ["Guaby", "MadLittleMods"], ["selfagency"], ["severus-tux", "severus-tux"], ["engradeelnayyar", "grahamperrin"], ["grahamperrin", "geekyi", "grahamperrin", "geekyi", "geekyi", "grahamperrin", "grahamperrin", "grahamperrin", "grahamperrin"], ["AlexandreBonneau", "MadLittleMods", "AlexandreBonneau"], ["TheCodingMeatball", "grahamperrin"], ["intellix", "mydigitalself", "intellix"], ["Maxels88", "grahamperrin", "Maxels88", "Maxels88", "Maxels88"], ["NonaSuomy", "dragon788", "dragon788", "dragon788", "dragon788", "dragon788", "NonaSuomy", "NonaSuomy", "NonaSuomy", "dragon788", "dragon788", "grahamperrin", "dragon788", "dragon788"], ["pdurbin", "pdurbin", "dragon788"], ["grahamperrin", "mydigitalself", "grahamperrin"], ["TetianaKhomko", "grahamperrin", "pdurbin"], ["jv110"], ["arunkumar413", "cbj4074", "grahamperrin", "grahamperrin", "grahamperrin", "MadLittleMods", "cbj4074"], ["indonogakusei", "indonogakusei", "grahamperrin"], ["lydatech", "dragon788", "lydatech", "dragon788", "toxik-io"], ["jmolivas"], ["Git-Buddy", "Git-Buddy", "pdurbin"], ["hillct"], ["weirdavid1_twitter", "weirdavid1_twitter", "grahamperrin", "weirdavid1_twitter", "weirdavid1_twitter"], ["mrhgomez1021"], ["meetvaghasia"], ["spiritloveroot_twitter", "pdurbin"], ["aj-willi", "aj-willi"], ["grahamperrin", "RodMyers", "grahamperrin", "grahamperrin"], ["DKurilo", "MadLittleMods", "DKurilo", "MadLittleMods", "dragon788", "DKurilo"], ["zachwelch"], ["tonimarquez85", "tonimarquez85", "tonimarquez85"], ["satdav", "satdav"], ["InternetUnexplorer"], ["lisbetho", "dragon788"], ["amitguptagwl"], ["matrixbot"], ["paramaggarwal_twitter", "qinxiaowen", "qinxiaowen"], ["OFFLlNE", "cbj4074", "OFFLlNE"], ["andyjefferson", "andyjefferson"], ["vadmeste", "vadmeste", "rom1504", "vadmeste", "rom1504", "vadmeste"]], "dialog_label": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "sen_label": [["OQ"], ["OQ", "SA", "UF"], ["OQ", "QA", "PF", "QE", "QA", "RA", "AE", "AE", "AE", "AE", "AE", "AE", "AE", "AE", "AE", "AE"], ["GG", "OQ", "SA", "PF"], ["OQ"], ["OQ", "QA", "SA", "UF", "AE", "AE", "AE", "AE"], ["OQ", "SA", "AE"], ["GG", "OQ", "SA", "AE", "QE", "QE", "SA", "PF", "GG", "SA"], ["AE", "AE", "JK", "SA", "AE", "AE", "GG", "JK"], ["OQ", "QA", "GG", "AE"], ["OQ", "SA", "AE", "SA", "UF", "AE", "AE", "AE", "AE"], ["OQ"], ["OQ", "QA"], ["OQ", "SA"], ["GG", "OQ", "QA", "AE", "QE", "AE"], ["GG", "OQ", "QE", "QE", "UF"], ["OQ"], ["OQ", "SA", "GG", "AE", "AE", "AE", "AE", "AE", "AE", "AE", "QE", "QA"], ["OQ", "SA", "SA", "UF"], ["OQ", "SA"], ["OQ", "SA"], ["OQ", "QE", "QA", "AE", "AE", "AE", "AE", "AE", "AE"], ["OQ", "SA", "QE", "QA", "AE", "PF", "QE", "QA", "SA"], ["OQ", "SA", "PF"], ["OQ", "QA", "QE", "AE", "AE", "AE", "RA"], ["OQ", "QE", "QA", "AE", "PF"], ["OQ"], ["GG", "OQ", "PF", "QE", "QA", "QE", "QA"], ["OQ", "JK", "SA"], ["GG", "OQ", "AE", "QE", "QE", "AE", "AE"], ["OQ", "SA", "AE", "PF", "GG"], ["OQ", "QA", "PF"], ["GG", "OQ", "QE", "QA", "SA"], ["GG", "OQ", "SA", "PF"], ["OQ", "SA"], ["OQ"], ["GG", "OQ"], ["OQ", "SA"], ["OQ", "QA", "AE", "AE", "AE", "AE", "AE", "AE", "AE"], ["OQ", "SA", "GG"], ["OQ", "SA"], ["OQ", "QA", "AE"], ["OQ", "QE", "QA", "AE", "GG"], ["OQ", "QA", "AE", "AE", "SA", "AE", "AE", "PF", "NF", "AE", "AE", "AE", "AE", "AE"], ["OQ", "JK", "QA"], ["OQ", "GG", "GG"], ["OQ", "SA", "AE"], ["GG"], ["OQ", "SA", "GG", "AE", "AE", "AE", "AE"], ["GG", "OQ", "SA"], ["OQ", "QA", "NF", "SA", "PF"], ["OQ"], ["GG", "OQ", "AE"], ["OQ"], ["OQ", "QE", "QA", "AE", "AE"], ["OQ"], ["GG"], ["OQ", "QA"], ["GG", "OQ"], ["OQ", "AE", "GG", "AE"], ["OQ", "SA", "QE", "QA", "SA", "UF"], ["OQ"], ["GG", "OQ", "GG"], ["GG", "OQ"], ["OQ"], ["OQ", "SA"], ["OQ"], ["OQ"], ["OQ", "QE", "JK"], ["OQ", "SA", "GG"], ["OQ", "AE"], ["GG", "OQ", "QE", "QA", "SA", "PF"]], "graph_edge": [[0], [[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10], [10, 11], [11, 12], [12, 13], [13, 14], [14, 15]], [[0, 1], [1, 2], [2, 3]], [0], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7]], [[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [2, 4], [4, 5], [5, 6], [6, 7], [6, 8], [8, 9]], [[0, 1], [1, 2], [0, 3], [0, 4], [4, 5], [5, 6], [6, 7]], [[0, 1], [1, 2], [2, 3]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8]], [0], [[0, 1]], [[0, 1]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5]], [[0, 1], [1, 2], [1, 3], [2, 4], [3, 4]], [0], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10]], [[0, 1], [0, 2], [2, 3]], [[0, 1]], [[0, 1]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8]], [[0, 1], [0, 2], [2, 3], [3, 4], [4, 5], [1, 5], [5, 6], [6, 7], [7, 8]], [[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [0, 6]], [[0, 1], [1, 2], [2, 3], [3, 4]], [0], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6]], [[0, 1], [0, 2]], [[0, 1], [1, 2], [2, 3], [2, 4], [4, 5], [5, 6]], [[0, 1], [1, 2], [1, 3], [1, 4]], [[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [3, 4]], [[0, 1], [1, 2], [2, 3]], [0], [0], [[0, 1]], [[0, 1]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8]], [[0, 1], [1, 2], [2, 3]], [[0, 1]], [[0, 1], [1, 2]], [[0, 1], [1, 2], [3, 4]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5], [5, 6], [6, 7], [7, 8], [8, 9], [9, 10], [0, 11], [10, 12], [12, 13]], [[0, 1], [1, 2]], [[0, 1], [1, 2]], [[0, 1], [1, 2]], [0], [[0, 1], [2, 3], [3, 4], [4, 5], [5, 6]], [[0, 1], [1, 2]], [[0, 1], [1, 2], [2, 3], [1, 4]], [0], [[0, 1], [1, 2]], [0], [[0, 1], [1, 2], [2, 3], [3, 4]], [0], [0], [[0, 1]], [[0, 1]], [[0, 1], [1, 2], [2, 3], [3, 4]], [[0, 1], [1, 2], [2, 3], [0, 4], [4, 5]], [0], [[0, 1], [1, 2]], [[0, 1]], [0], [[0, 1]], [0], [0], [[0, 1], [1, 2]], [[0, 1], [1, 2]], [[0, 1]], [[0, 1], [1, 2], [2, 3], [3, 4], [4, 5]]]}